.emacs.d/config.org
+TITLE: Emacs Configuration
#+AUTHOR: Adam
#+DESCRIPTION: A comprehensive Emacs configuration with modern completion, project management, and productivity tools
#+PROPERTY: header-args:emacs-lisp :tangle yes
#+STARTUP: content
#+EMACS_VERSION: Compatible with Emacs 30.2+ (tested with backward compatibility)

* Configuration Overview

This configuration provides a modern, IDE-like Emacs experience with focus on productivity, discoverability, and performance. It combines proven packages with sensible defaults to create a powerful development environment.

*Key Principles:*
- Minimal startup time with performance optimizations
- Discoverable interface with which-key and hydra menus
- Modern completion framework (Vertico/Consult/Orderless)
- Comprehensive project management with Projectile
- Rich Org-mode setup for note-taking and task management
- Visual enhancements for better code readability
- Emacs 30.2+ compatibility with graceful fallbacks for older versions

*Getting Started:*
1. Install required fonts: [[https://www.nerdfonts.com/font-downloads][Hack Nerd Font]]
2. Install LSP servers for your languages (see Editor section)
3. Use =F1= to access the cheatsheet system
4. Run =M-x package-list-packages= to see all available packages
5. Check =C-h v= for variable documentation, =C-h f= for functions

*Configuration Structure:*
- Core Settings: Performance and essential defaults
- UI Changes: Visual customizations and themes
- Package Management: MELPA, GNU ELPA setup
- Completion: Modern completion stack
- Editor: LSP, completion, syntax checking
- Git: Magit integration and workflows
- Org Mode: Comprehensive productivity system
- Projects: Projectile for project management
- Cheatsheet: Hydra-based command reference

*Support and Documentation:*
- Use =C-h k= followed by a key to see what it does
- Use =C-h f= to get help on any function
- Use =C-h v= to get help on any variable
- Visit package GitHub repositories for detailed documentation
- Use =F1= to access the interactive cheatsheet system

* Table Of Contents :TOC:
- [[#configuration-overview][Configuration Overview]]
- [[#core-settings][Core Settings]]
  - [[#basic-configuration][Basic Configuration]]
- [[#ui-changes][UI changes]]
  - [[#main-emacs-frame][Main Emacs Frame]]
  - [[#font-settings][Font Settings]]
  - [[#theme][Theme]]
  - [[#visual-enhancements][Visual Enhancements]]
    - [[#beacon-mode][Beacon Mode]]
    - [[#rainbow-delimiters][Rainbow Delimiters]]
    - [[#highlight-indent-guides][Highlight Indent Guides]]
    - [[#highlight-numbers][Highlight Numbers]]
    - [[#rainbow-mode---color-preview][Rainbow Mode - Color Preview]]
  - [[#dashboard][Dashboard]]
- [[#package-management][Package Management]]
- [[#completion][Completion]]
  - [[#vertico][Vertico]]
    - [[#package-install-and-init][Package Install and Init]]
    - [[#savehist][Savehist]]
    - [[#emacs-minibuffer-settings][Emacs Minibuffer Settings]]
  - [[#orderless][Orderless]]
  - [[#marginalia][Marginalia]]
  - [[#consult][Consult]]
  - [[#embark][Embark]]
  - [[#embark-consult][Embark-Consult]]
  - [[#enhanced-help-system][Enhanced Help System]]
    - [[#helpful][Helpful]]
  - [[#file-management-enhancements][File Management Enhancements]]
    - [[#dired-sidebar][Dired Sidebar]]
    - [[#dired-rainbow][Dired Rainbow]]
    - [[#all-the-icons-dired][All The Icons Dired]]
  - [[#note-taking-enhancement][Note-Taking Enhancement]]
    - [[#deft][Deft]]
  - [[#wgrep][wgrep]]
- [[#keybinds][Keybinds]]
  - [[#global][Global]]
  - [[#which-key][Which-Key]]
- [[#editor][Editor]]
  - [[#eglot][Eglot]]
  - [[#flymake][Flymake]]
  - [[#corfu][Corfu]]
    - [[#corfu-popupinfo-built-into-corfu][corfu-popupinfo (built into corfu)]]
    - [[#nerd-icons-corfu][nerd-icons-corfu]]
  - [[#cape][Cape]]
  - [[#prescient][Prescient]]
    - [[#corfu-prescient][corfu-prescient]]
  - [[#language-enhancements][Language Enhancements]]
    - [[#python][Python]]
  - [[#mode-specific-keybindings][Mode-Specific Keybindings]]
    - [[#programming-mode-base-keybindings][Programming Mode Base Keybindings]]
    - [[#python-mode-specific][Python Mode Specific]]
    - [[#javascripttypescript-mode-specific][JavaScript/TypeScript Mode Specific]]
    - [[#rust-mode-specific][Rust Mode Specific]]
    - [[#web-development-mode-specific][Web Development Mode Specific]]
    - [[#ansible-mode-specific][Ansible Mode Specific]]
    - [[#javascripttypescript][JavaScript/TypeScript]]
    - [[#web][Web]]
    - [[#additional-language-modes][Additional Language Modes]]
  - [[#snippets][Snippets]]
    - [[#additional-language-snippet-packs-optional][Additional language snippet packs (optional)]]
    - [[#corfucape-integration][Corfu/Cape Integration]]
  - [[#support-functions-and-settings][Support Functions and Settings]]
  - [[#text-manipulation][Text Manipulation]]
    - [[#electric-pair-mode][Electric Pair Mode]]
    - [[#smartparens][Smartparens]]
    - [[#expand-region][Expand Region]]
    - [[#embrace][Embrace]]
  - [[#formatters][Formatters]]
    - [[#apheleia][Apheleia]]
  - [[#window-management][Window Management]]
    - [[#ace-window][Ace Window]]
    - [[#popper---popup-management][Popper - Popup Management]]
    - [[#perspective---workspace-management][Perspective - Workspace Management]]
  - [[#navigation][Navigation]]
    - [[#avy][Avy]]
- [[#git][Git]]
  - [[#magit][Magit]]
    - [[#git-commit][git-commit]]
    - [[#magit-delta][magit-delta]]
    - [[#diff-hl][diff-hl]]
    - [[#git-timemachine][git-timemachine]]
    - [[#forge][forge]]
    - [[#magit-todos][magit-todos]]
    - [[#git-modes-gitconfig-gitignore-etc][Git Modes (gitconfig, gitignore, etc.)]]
    - [[#magit-file-icons-disabled---package-unavailable][magit-file-icons (disabled - package unavailable)]]
  - [[#support-functions][Support functions]]
- [[#org-mode][Org Mode]]
  - [[#core-org-configuration][Core Org Configuration]]
  - [[#org-agenda][Org Agenda]]
  - [[#org-capture][Org Capture]]
  - [[#org-babel][Org Babel]]
  - [[#org-export-base][Org Export Base]]
  - [[#org-roam][Org Roam]]
  - [[#enhanced-ui---org-modern][Enhanced UI - Org Modern]]
  - [[#enhanced-ui---org-superstar][Enhanced UI - Org Superstar]]
  - [[#enhanced-ui---org-appear][Enhanced UI - Org Appear]]
  - [[#table-of-contents---toc-org][Table of Contents - TOC Org]]
  - [[#robust-export-options---pandoc][Robust Export Options - Pandoc]]
  - [[#robust-export-options---hugo][Robust Export Options - Hugo]]
  - [[#export-extensions---additional-formats][Export Extensions - Additional Formats]]
  - [[#transient-menus---hydra-for-org][Transient Menus - Hydra for Org]]
  - [[#transient-menus---org-roam-hydra][Transient Menus - Org Roam Hydra]]
  - [[#cheatsheet-system---hydra-keybind-reference][Cheatsheet System - Hydra Keybind Reference]]
  - [[#export-menu-enhancement][Export Menu Enhancement]]
  - [[#advanced-features---org-ql][Advanced Features - Org QL]]
  - [[#web-integration---org-cliplink][Web Integration - Org Cliplink]]
  - [[#media-management---org-download][Media Management - Org Download]]
  - [[#enhanced-agenda---org-super-agenda][Enhanced Agenda - Org Super Agenda]]
- [[#projects][Projects]]
  - [[#enhanced-projectile-integration][Enhanced Projectile Integration]]
    - [[#consult-projectile][Consult Projectile]]
  - [[#projectile][Projectile]]
    - [[#projectile-ripgrep][projectile-ripgrep]]
    - [[#support-functions-1][Support Functions]]
- [[#ai-tools][AI Tools]]
  - [[#aider][Aider]]

* Core Settings

This section contains fundamental Emacs configuration settings that establish the baseline behavior for the editor. These settings improve performance, security, and user experience.

** Basic Configuration

Essential Emacs settings that provide better defaults and improved user experience. These configurations handle file backups, auto-saving, security, and performance optimizations.

| Setting Category | Description | Documentation |
|------------------|-------------|---------------|
| Personal Info | User name and email for version control | =C-h v user-full-name= |
| File Management | Backup and auto-save configuration | =C-h v backup-directory-alist= |
| Security | TLS verification and local variables | =C-h v gnutls-verify-error= |
| Performance | GC threshold and process output limits | =C-h v gc-cons-threshold= |
| Editing | Tab settings and fill column defaults | =C-h v indent-tabs-mode= |

*Key Features:*
- Centralized backup directory (~/.emacs.d/backups)
- Enhanced security with TLS verification
- Performance optimizations for large files
- Recent files tracking (25 items)
- Auto-revert for file changes
#+begin_src emacs-lisp
;; Personal information
(setq user-full-name "Adam"  ; Update this to your actual name
      user-mail-address "your@email.com")  ; Update this to your actual email

;; Custom file location
(setq custom-file (locate-user-emacs-file "custom.el"))
(load custom-file 'noerror)

;; Essential modes
(recentf-mode 1)
(save-place-mode 1)
(delete-selection-mode 1)
(global-auto-revert-mode 1)

;; Backup and auto-save configuration
(setq backup-directory-alist '(("." . "~/.emacs.d/backups"))
      backup-by-copying t
      delete-old-versions t
      kept-new-versions 6
      kept-old-versions 2
      version-control t
      auto-save-file-name-transforms '((".*" "~/.emacs.d/auto-save-list/" t)))

;; Security settings
(setq gnutls-verify-error t
      enable-local-variables :safe)

;; Performance settings
(setq read-process-output-max (* 1024 1024))  ; 1MB
(setq gc-cons-threshold (* 2 1000 1000))

;; Native compilation: quiet noisy async warnings across Emacs versions.
;; Emacs 29/30 use `comp-*`; Emacs 28 used `native-comp-*` (now aliases).
;; Set both when available, and suppress the warning category in *Warnings*.
(when (boundp 'comp-async-report-warnings-errors)
  (setq comp-async-report-warnings-errors nil))
(when (boundp 'native-comp-async-report-warnings-errors)
  (setq native-comp-async-report-warnings-errors nil))

;; Also suppress compiler warnings from appearing in the *Warnings* buffer.
;; Keep other warning categories intact.
(dolist (cat '((comp) (native-comp)))
  (add-to-list 'warning-suppress-types cat)
  (when (boundp 'warning-suppress-log-types)
    (add-to-list 'warning-suppress-log-types cat)))

;; Environment: Inherit PATH from shell (crucial for GUI Emacs)
;; This ensures tools like pandoc, language servers, and other binaries are found
(use-package exec-path-from-shell
  :ensure t
  :if (memq window-system '(mac ns x pgtk))  ; Only for GUI Emacs
  :config
  (exec-path-from-shell-initialize))

;; Fallback: Add common binary paths for Linux systems
(when (and (not (memq window-system '(mac ns)))
           (eq system-type 'gnu/linux))
  (let ((common-paths '("/usr/local/bin" "/usr/bin" "/bin")))
    (dolist (path common-paths)
      (when (and (file-directory-p path)
                 (not (member path exec-path)))
        (add-to-list 'exec-path path t)))))

;; Better defaults
(setq-default indent-tabs-mode nil
              tab-width 4
              fill-column 80)

;; Recent files
(setq recentf-max-menu-items 25
      recentf-max-saved-items 25)

;; Save place in files
(setq save-place-file (locate-user-emacs-file "places"))

;; Auto-revert settings
(setq global-auto-revert-non-file-buffers t
      auto-revert-verbose nil)
#+end_src

* UI changes

Visual customizations that create a clean, distraction-free editing environment. These settings remove unnecessary GUI elements and improve the overall aesthetic.

