.emacs.d/config.el
;; Personal information
(setq user-full-name "Adam"  ; Update this to your actual name
      user-mail-address "your@email.com")  ; Update this to your actual email

;; Custom file location
(setq custom-file (locate-user-emacs-file "custom.el"))
(load custom-file 'noerror)

;; Essential modes
(recentf-mode 1)
(save-place-mode 1)
(delete-selection-mode 1)
(global-auto-revert-mode 1)

;; Backup and auto-save configuration
(setq backup-directory-alist '(("." . "~/.emacs.d/backups"))
      backup-by-copying t
      delete-old-versions t
      kept-new-versions 6
      kept-old-versions 2
      version-control t
      auto-save-file-name-transforms '((".*" "~/.emacs.d/auto-save-list/" t)))

;; Security settings
(setq gnutls-verify-error t
      enable-local-variables :safe)

;; Performance settings
(setq read-process-output-max (* 1024 1024))  ; 1MB
(setq gc-cons-threshold (* 2 1000 1000))

;; Native compilation: quiet noisy async warnings across Emacs versions.
;; Emacs 29/30 use `comp-*`; Emacs 28 used `native-comp-*` (now aliases).
;; Set both when available, and suppress the warning category in *Warnings*.
(when (boundp 'comp-async-report-warnings-errors)
  (setq comp-async-report-warnings-errors nil))
(when (boundp 'native-comp-async-report-warnings-errors)
  (setq native-comp-async-report-warnings-errors nil))

;; Also suppress compiler warnings from appearing in the *Warnings* buffer.
;; Keep other warning categories intact.
(dolist (cat '((comp) (native-comp)))
  (add-to-list 'warning-suppress-types cat)
  (when (boundp 'warning-suppress-log-types)
    (add-to-list 'warning-suppress-log-types cat)))

;; Environment: Inherit PATH from shell (crucial for GUI Emacs)
;; This ensures tools like pandoc, language servers, and other binaries are found
(use-package exec-path-from-shell
  :ensure t
  :if (memq window-system '(mac ns x pgtk))  ; Only for GUI Emacs
  :config
  (exec-path-from-shell-initialize))

;; Fallback: Add common binary paths for Linux systems
(when (and (not (memq window-system '(mac ns)))
           (eq system-type 'gnu/linux))
  (let ((common-paths '("/usr/local/bin" "/usr/bin" "/bin")))
    (dolist (path common-paths)
      (when (and (file-directory-p path)
                 (not (member path exec-path)))
        (add-to-list 'exec-path path t)))))

;; Better defaults
(setq-default indent-tabs-mode nil
              tab-width 4
              fill-column 80)

;; Recent files
(setq recentf-max-menu-items 25
      recentf-max-saved-items 25)

;; Save place in files
(setq save-place-file (locate-user-emacs-file "places"))

;; Auto-revert settings
(setq global-auto-revert-non-file-buffers t
      auto-revert-verbose nil)
