.emacs.d/config.el

(setq inhibit-startup-message t) ; Disable startup message
(scroll-bar-mode -1) ; Disable scroll bar
(tool-bar-mode -1) ; Disable tool bar
(tooltip-mode -1) ; Disable tooltips
(set-fringe-mode 10) ; Add area for easier viewing
(menu-bar-mode -1) ; Disable the menu bar

;; Bell configuration - disable the annoying yellow triangle
;; Option 1: Completely disable all bell sounds/visuals
(setq ring-bell-function 'ignore)

;; Option 2: Use a subtle mode-line flash instead (uncomment to use)
(defun my/mode-line-visual-bell ()
  "Flash the mode line as a visual bell."
  (let ((orig-bg (face-background 'mode-line)))
    (set-face-background 'mode-line "red")
    (run-with-idle-timer 0.1 nil
                         (lambda (bg) (set-face-background 'mode-line bg))
                         orig-bg)))
(setq ring-bell-function #'my/mode-line-visual-bell)

;; Option 3: Invert mode-line briefly (uncomment to use)
;; (defun my/mode-line-invert-bell ()
;;   "Invert the mode line as a visual bell."
;;   (invert-face 'mode-line)
;;   (run-with-timer 0.1 nil 'invert-face 'mode-line))
;; (setq ring-bell-function #'my/mode-line-invert-bell)

(set-face-attribute 'default nil :font "Hack Nerd Font" :height 200)

(use-package catppuccin-theme
  :ensure t
  :custom
  (catppuccin-flavor 'macchiato)  ; Options: latte, frappe, macchiato, mocha
  :config
  (load-theme 'catppuccin :no-confirm))

(use-package beacon
  :ensure t
  :config
  (beacon-mode 1)

  :custom
  ;; Beacon appearance
  (beacon-size 40)          ; Size of the beacon
  (beacon-color "#ff6c6b")  ; Color (red-ish, adjust to match your theme)

  ;; When to show beacon
  (beacon-blink-when-point-moves-vertically 10)  ; Blink when moving 10+ lines
  (beacon-blink-when-point-moves-horizontally 20) ; Blink when moving 20+ chars
  (beacon-blink-when-buffer-changes t)           ; Blink on buffer switch
  (beacon-blink-when-window-changes t)           ; Blink on window switch
  (beacon-blink-when-window-scrolls t)           ; Blink on scroll

  ;; Duration
  (beacon-blink-duration 0.3)  ; How long the beacon lasts
  (beacon-blink-delay 0.3))    ; Delay before showing

;; Initialize whitespace-mode early to define faces
(require 'whitespace)

(use-package rainbow-delimiters
  :ensure t
  :hook (prog-mode . rainbow-delimiters-mode))

;; Fallback indentation guides using built-in whitespace-mode to avoid
;; hard dependency on external packages when offline/unavailable.
(defface my/indent-guides-face
  '((t :inherit shadow))
  "Face for fallback indentation guides.")

(define-minor-mode my/indent-guides-fallback-mode
  "Show simple indentation guides using whitespace-mode."
  :lighter " ⎸"
  (if my/indent-guides-fallback-mode
      (progn
        ;; Tame whitespace to only highlight indentation
        (setq-local whitespace-style '(face indentation))
        (setq-local whitespace-space-regexp "^ +")
        ;; Soften the face
        (set-face-attribute 'whitespace-indentation nil :inherit 'my/indent-guides-face)
        (whitespace-mode 1))
    (whitespace-mode -1)))

;; Prefer highlight-indent-guides when installed; else enable fallback.
(if (package-installed-p 'highlight-indent-guides)
    (use-package highlight-indent-guides
      :ensure nil                ;; avoid auto-install on startup if missing
      :if (package-installed-p 'highlight-indent-guides)
      :hook (prog-mode . highlight-indent-guides-mode)
      :custom
      (highlight-indent-guides-method 'character)
      (highlight-indent-guides-character ?\|)
      (highlight-indent-guides-responsive 'top)
      (highlight-indent-guides-delay 0))
  (add-hook 'prog-mode-hook #'my/indent-guides-fallback-mode))

;; Simple built-in fallback for number highlighting to avoid hard depending on
;; external packages. This keeps startup robust even if MELPA is unavailable.
(defface my/number-face
  '((t :inherit font-lock-constant-face))
  "Face used to highlight numeric literals when fallback is active.")

(defvar my/number--font-lock
  '(("\\_<-?[0-9]+\\(\\.[0-9]+\\)?\\([eE][+-]?[0-9]+\\)?\\_>" 0 'my/number-face keep)))

(define-minor-mode my/number-highlighting-mode
  "Fallback minor mode to highlight numbers via font-lock."
  :lighter " #"
  (if my/number-highlighting-mode
      (progn
        (font-lock-add-keywords nil my/number--font-lock)
        (font-lock-flush))
    (font-lock-remove-keywords nil my/number--font-lock)
    (font-lock-flush)))

;; Prefer highlight-numbers when it is installed; otherwise enable the fallback.
;; Using :if prevents use-package from trying to install it when unavailable.
(if (package-installed-p 'highlight-numbers)
    (use-package highlight-numbers
      :if (package-installed-p 'highlight-numbers)
      :hook (prog-mode . highlight-numbers-mode))
  (add-hook 'prog-mode-hook #'my/number-highlighting-mode))

(use-package rainbow-mode
  :ensure t
  :hook ((css-mode sass-mode scss-mode less-css-mode) . rainbow-mode))
