.emacs.d/config.org
** Dashboard

Modern startup screen that replaces the default Emacs startup buffer with useful information, quick access to recent files, projects, and bookmarks. Provides a welcoming and functional entry point to your Emacs session.

*Project:* [[https://github.com/emacs-dashboard/emacs-dashboard][GitHub - emacs-dashboard]]
*Key Features:*
- Recent files and projects display
- Quick navigation shortcuts
- Customizable widgets and banners
- Session restoration capabilities
- Integration with projectile and recent files

*Widgets Available:*
| Widget | Purpose | Shortcut |
|--------|---------|----------|
| Recent files | Recently opened files | r |
| Projects | Projectile projects | p |
| Bookmarks | Saved bookmarks | m |
| Agenda | Org agenda items | a |

#+begin_src emacs-lisp
(use-package dashboard
  :ensure t
  :config
  (dashboard-setup-startup-hook)

  :custom
  ;; Dashboard configuration
  (dashboard-banner-logo-title "Welcome to Emacs Dashboard")
  (dashboard-startup-banner "~/.emacs.d/catppuccin-logo.txt")  ; Use custom Catppuccin ASCII art
  (dashboard-center-content t)
  (dashboard-show-shortcuts t)
  (dashboard-display-icons-p t)
  (dashboard-icon-type 'nerd-icons)  ; Use nerd-icons for consistent theming

  ;; Widget configuration
  (dashboard-items '((recents   . 8)
                     (projects  . 6)
                     (bookmarks . 5)
                     (agenda    . 5)))

  ;; Content configuration
  (dashboard-set-heading-icons t)
  (dashboard-set-file-icons t)
  (dashboard-set-navigator t)
  (dashboard-set-init-info t)

  ;; Navigator configuration
  (dashboard-navigator-buttons
   `(;; First row
     ((,(nerd-icons-codicon "nf-cod-home")
       "Homepage"
       "Browse homepage"
       (lambda (&rest _) (browse-url "https://github.com/emacs-dashboard/emacs-dashboard")))
      (,(nerd-icons-codicon "nf-cod-gear")
       "Settings"
       "Open config file"
       (lambda (&rest _) (find-file user-init-file)))
      (,(nerd-icons-codicon "nf-cod-refresh")
       "Refresh"
       "Refresh dashboard"
       (lambda (&rest _) (dashboard-refresh-buffer))))))

  ;; Footer messages
  (dashboard-footer-messages '("The one true editor, Emacs!"
                              "Who the hell uses VIM anyway? Go Evil!"
                              "Free as in Freedom!"
                              "Created with 💚 and lots of ☕"))
  (dashboard-footer-icon (nerd-icons-codicon "nf-cod-heart"))

  ;; Performance
  (dashboard-page-separator "\n\f\n")
  (dashboard-set-file-icons t))

;; Dashboard improvements
(setq initial-buffer-choice (lambda () (get-buffer-create "*dashboard*")))

;; Refresh dashboard when killing other buffers
(add-hook 'after-init-hook 'dashboard-refresh-buffer)

;; Custom dashboard functions
(defun my/dashboard-goto-recent-files ()
  "Jump to recent files section in dashboard."
  (interactive)
  (dashboard-open)
  (dashboard-jump-to-recent-files))

(defun my/dashboard-goto-projects ()
  "Jump to projects section in dashboard."
  (interactive)
  (dashboard-open)
  (dashboard-jump-to-projects))

;; Key bindings for dashboard navigation
(with-eval-after-load 'dashboard
  (define-key dashboard-mode-map (kbd "r") 'dashboard-jump-to-recent-files)
  (define-key dashboard-mode-map (kbd "p") 'dashboard-jump-to-projects)
  (define-key dashboard-mode-map (kbd "m") 'dashboard-jump-to-bookmarks)
  (define-key dashboard-mode-map (kbd "a") 'dashboard-jump-to-agenda)
  (define-key dashboard-mode-map (kbd "g") 'dashboard-refresh-buffer))
#+end_src

* Package Management

Configuration for Emacs package system using MELPA, Org, and GNU ELPA repositories. This setup provides access to thousands of community packages while ensuring reliable installation and updates.

*Key Features:*
- Multiple package archives for maximum package availability
- Automatic package installation with use-package
- Package signature verification for security

*Package Archives:*
| Repository | URL | Purpose |
|------------|-----|---------|
| MELPA | https://melpa.org/packages/ | Latest packages, frequent updates |
| Org ELPA | https://orgmode.org/elpa | Official Org-mode packages |
| GNU ELPA | https://elpa.gnu.org/packages | Stable, curated packages |

*Documentation:* =C-h f package-initialize=, =C-h v package-archives=
*Package Browser:* =M-x list-packages=
#+begin_src emacs-lisp
;; Package setup is now handled in init.el to ensure proper loading order
;; (require 'package)
;; (setq package-archives '(("melpa" . "https://melpa.org/packages/")
;;                          ("gnu" . "https://elpa.gnu.org/packages/")
;;                          ("org" . "https://orgmode.org/elpa/")
;;                          ("nongnu" . "https://elpa.nongnu.org/nongnu/")))

;; (package-initialize) ; Unnecessary in Emacs 27+
;; Be resilient when offline/unavailable.
(condition-case err
    (progn
      (unless package-archive-contents
        (package-refresh-contents))
      (unless (package-installed-p 'use-package)
        (package-install 'use-package)))
  (error (message "Package setup skipped due to error: %s" err)))

(require 'use-package)
(setq use-package-always-ensure t)

;; Install hydra for transient menus
(use-package hydra
  :ensure t)
#+end_src

#+begin_src emacs-lisp
;; Automatic tangling and basic diagnostics for config.org
(defconst my/config-org-file "/home/adam/.emacs.d/config.org"
  "Absolute path to the literate Emacs config (config.org).")

(defun my/tangle-config-org ()
  "Tangle `config.org' to produce `config.el'.
This is safe to call interactively or at startup; errors are caught and
reported via `message'."
  (interactive)
  (when (file-exists-p my/config-org-file)
    (condition-case err
        (progn
          (require 'org)
          (require 'ob-tangle)
          (with-current-buffer (find-file-noselect my/config-org-file)
            (org-babel-tangle))
          (message "Tangled %s -> config.el" my/config-org-file))
      (error (message "Error tangling %s: %s" my/config-org-file err)))))

;; Tangle when `config.org' is saved: global hook checks filename to avoid
;; attaching buffer-local hooks manually.
(add-hook 'after-save-hook
          (lambda ()
            (when (and (buffer-file-name)
                       (string-equal (file-truename (buffer-file-name))
                                     (file-truename my/config-org-file)))
              (my/tangle-config-org))))

(defun my/check-package-archives ()
  "Quickly check that common package archives are reachable.
This uses `url-retrieve-synchronously' with a short timeout and logs
status via `message'."
  (condition-case err
      (progn
        (require 'url)
        (dolist (a '("https://melpa.org/packages/"
                     "https://elpa.gnu.org/packages/"
                     "https://orgmode.org/elpa/"
                     "https://elpa.nongnu.org/nongnu/"))
          (condition-case e
              (let ((buf (url-retrieve-synchronously a t t 10)))
                (if (and buf (> (buffer-size buf) 0))
                    (message "Archive reachable: %s" a)
                  (message "Archive not reachable (empty response): %s" a))
                (when buf (kill-buffer buf)))
            (error (message "Error reaching %s: %s" a e)))))
    (error (message "Error checking package archives: %s" err))))

;; Run a quick check at startup (non-blocking-ish); errors are caught.
(run-at-time 0.1 nil #'my/check-package-archives)

#+end_src
* Completion

Modern completion framework built around Vertico, Orderless, Marginalia, and Consult. This stack provides fast, flexible, and highly customizable completion for commands, files, buffers, and more.

*The Modern Completion Stack:*
| Component | Purpose | Documentation |
|-----------|---------|---------------|
| Vertico | Vertical completion UI | =C-h f vertico-mode= |
| Orderless | Flexible matching styles | =C-h f orderless= |
| Marginalia | Rich completion annotations | =C-h f marginalia-mode= |
| Consult | Advanced completion commands | =C-h f consult-buffer= |
| Embark | Context-aware actions | =C-h f embark-act= |

*Key Benefits:*
- Lightning-fast completion with incremental updates
- Fuzzy and orderless matching for flexible searches
- Rich contextual information for better decision making
- Extensible actions system for powerful workflows

** Vertico

Minimal but powerful vertical completion UI that replaces Emacs' built-in completion system. Provides smooth scrolling, cycling, and excellent performance even with thousands of candidates.

*Project:* [[https://github.com/minad/vertico][GitHub - minad/vertico]]
*Configuration:* 20 candidates, cycling enabled, auto-resize
*Documentation:* =C-h f vertico-mode=, =C-h v vertico-count=

