.emacs.d/config.el

(use-package dashboard
  :ensure t
  :config
  (dashboard-setup-startup-hook)

  :custom
  ;; Dashboard configuration
  (dashboard-banner-logo-title "Welcome to Emacs Dashboard")
  (dashboard-startup-banner "~/.emacs.d/catppuccin-logo.txt")  ; Use custom Catppuccin ASCII art
  (dashboard-center-content t)
  (dashboard-show-shortcuts t)
  (dashboard-display-icons-p t)
  (dashboard-icon-type 'nerd-icons)  ; Use nerd-icons for consistent theming

  ;; Widget configuration
  (dashboard-items '((recents   . 8)
                     (projects  . 6)
                     (bookmarks . 5)
                     (agenda    . 5)))

  ;; Content configuration
  (dashboard-set-heading-icons t)
  (dashboard-set-file-icons t)
  (dashboard-set-navigator t)
  (dashboard-set-init-info t)

  ;; Navigator configuration
  (dashboard-navigator-buttons
   `(;; First row
     ((,(nerd-icons-codicon "nf-cod-home")
       "Homepage"
       "Browse homepage"
       (lambda (&rest _) (browse-url "https://github.com/emacs-dashboard/emacs-dashboard")))
      (,(nerd-icons-codicon "nf-cod-gear")
       "Settings"
       "Open config file"
       (lambda (&rest _) (find-file user-init-file)))
      (,(nerd-icons-codicon "nf-cod-refresh")
       "Refresh"
       "Refresh dashboard"
       (lambda (&rest _) (dashboard-refresh-buffer))))))

  ;; Footer messages
  (dashboard-footer-messages '("The one true editor, Emacs!"
                              "Who the hell uses VIM anyway? Go Evil!"
                              "Free as in Freedom!"
                              "Created with 💚 and lots of ☕"))
  (dashboard-footer-icon (nerd-icons-codicon "nf-cod-heart"))

  ;; Performance
  (dashboard-page-separator "\n\f\n")
  (dashboard-set-file-icons t))

;; Dashboard improvements
(setq initial-buffer-choice (lambda () (get-buffer-create "*dashboard*")))

;; Refresh dashboard when killing other buffers
(add-hook 'after-init-hook 'dashboard-refresh-buffer)

;; Custom dashboard functions
(defun my/dashboard-goto-recent-files ()
  "Jump to recent files section in dashboard."
  (interactive)
  (dashboard-open)
  (dashboard-jump-to-recent-files))

(defun my/dashboard-goto-projects ()
  "Jump to projects section in dashboard."
  (interactive)
  (dashboard-open)
  (dashboard-jump-to-projects))

;; Key bindings for dashboard navigation
(with-eval-after-load 'dashboard
  (define-key dashboard-mode-map (kbd "r") 'dashboard-jump-to-recent-files)
  (define-key dashboard-mode-map (kbd "p") 'dashboard-jump-to-projects)
  (define-key dashboard-mode-map (kbd "m") 'dashboard-jump-to-bookmarks)
  (define-key dashboard-mode-map (kbd "a") 'dashboard-jump-to-agenda)
  (define-key dashboard-mode-map (kbd "g") 'dashboard-refresh-buffer))

;; Package setup is now handled in init.el to ensure proper loading order
;; (require 'package)
;; (setq package-archives '(("melpa" . "https://melpa.org/packages/")
;;                          ("gnu" . "https://elpa.gnu.org/packages/")
;;                          ("org" . "https://orgmode.org/elpa/")
;;                          ("nongnu" . "https://elpa.nongnu.org/nongnu/")))

;; (package-initialize) ; Unnecessary in Emacs 27+
;; Be resilient when offline/unavailable.
(condition-case err
    (progn
      (unless package-archive-contents
        (package-refresh-contents))
      (unless (package-installed-p 'use-package)
        (package-install 'use-package)))
  (error (message "Package setup skipped due to error: %s" err)))

(require 'use-package)
(setq use-package-always-ensure t)

;; Install hydra for transient menus
(use-package hydra
  :ensure t)

;; Automatic tangling and basic diagnostics for config.org
(defconst my/config-org-file "/home/adam/.emacs.d/config.org"
  "Absolute path to the literate Emacs config (config.org).")

(defun my/tangle-config-org ()
  "Tangle `config.org' to produce `config.el'.
This is safe to call interactively or at startup; errors are caught and
reported via `message'."
  (interactive)
  (when (file-exists-p my/config-org-file)
    (condition-case err
        (progn
          (require 'org)
          (require 'ob-tangle)
          (with-current-buffer (find-file-noselect my/config-org-file)
            (org-babel-tangle))
          (message "Tangled %s -> config.el" my/config-org-file))
      (error (message "Error tangling %s: %s" my/config-org-file err)))))

;; Tangle when `config.org' is saved: global hook checks filename to avoid
;; attaching buffer-local hooks manually.
(add-hook 'after-save-hook
          (lambda ()
            (when (and (buffer-file-name)
                       (string-equal (file-truename (buffer-file-name))
                                     (file-truename my/config-org-file)))
              (my/tangle-config-org))))

(defun my/check-package-archives ()
  "Quickly check that common package archives are reachable.
This uses `url-retrieve-synchronously' with a short timeout and logs
status via `message'."
  (condition-case err
      (progn
        (require 'url)
        (dolist (a '("https://melpa.org/packages/"
                     "https://elpa.gnu.org/packages/"
                     "https://orgmode.org/elpa/"
                     "https://elpa.nongnu.org/nongnu/"))
          (condition-case e
              (let ((buf (url-retrieve-synchronously a t t 10)))
                (if (and buf (> (buffer-size buf) 0))
                    (message "Archive reachable: %s" a)
                  (message "Archive not reachable (empty response): %s" a))
                (when buf (kill-buffer buf)))
            (error (message "Error reaching %s: %s" a e)))))
    (error (message "Error checking package archives: %s" err))))

;; Run a quick check at startup (non-blocking-ish); errors are caught.
(run-at-time 0.1 nil #'my/check-package-archives)
