.emacs.d/config.org
*** Package Install and Init
#+begin_src emacs-lisp
;; Make Vertico optional so startup isn't blocked when offline.
(use-package vertico
  :ensure t
  :custom
  (vertico-count 10)
  (vertico-resize nil)
  (vertico-cycle t)
  :init
  (vertico-mode 1)
  :bind (:map vertico-map
              ("TAB" . minibuffer-complete)  ; Complete common prefix first, then cycle
              ("<tab>" . minibuffer-complete)
              ("S-TAB" . vertico-previous)  ; Cycle backwards with Shift+TAB
              ("<backtab>" . vertico-previous)
              ("DEL" . vertico-directory-delete-char)    ; Delete by directory
              ("<backspace>" . vertico-directory-delete-char)
              ("M-DEL" . vertico-directory-delete-word)  ; Delete word, respecting directories
              ("C-w" . vertico-directory-delete-word)    ; Alternative delete word
              ("RET" . vertico-directory-enter)          ; Enter directory or complete
              ("<return>" . vertico-directory-enter)))

(unless (package-installed-p 'vertico)
  (message "Vertico not installed; using default completion UI (M-x package-install RET vertico RET)"))

;; Vertico Directory Extension - provides directory-aware navigation
(use-package vertico-directory
  :after vertico
  :ensure nil  ; Built into vertico
  :hook (rfn-eshadow-update-overlay . vertico-directory-tidy))

;; Additional minibuffer quality-of-life improvements
(with-eval-after-load 'vertico
  ;; Add prompt indicator to `completing-read-multiple'
  (defun crm-indicator (args)
    (cons (format "[CRM%s] %s"
                  (replace-regexp-in-string
                   "\\`\\[.*?]\\*\\|\\[.*?]\\*\\'" ""
                   crm-separator)
                  (car args))
          (cdr args)))
  (advice-add #'completing-read-multiple :filter-args #'crm-indicator)

  ;; Do not allow the cursor in the minibuffer prompt
  (setq minibuffer-prompt-properties
        '(read-only t cursor-intangible t face minibuffer-prompt))
  (add-hook 'minibuffer-setup-hook #'cursor-intangible-mode)

  ;; Enable recursive minibuffers (allows minibuffer commands while in minibuffer)
  (setq enable-recursive-minibuffers t))

;; Enhanced TAB completion behavior for vertico
(with-eval-after-load 'vertico
  ;; Configure completion to cycle through options after completing common prefix
  (setq completion-cycle-threshold 3)  ; Start cycling after 3 or fewer completions
  (setq completion-auto-help nil)      ; Don't show *Completions* buffer

  ;; Custom function for smart TAB completion
  (defun my/vertico-smart-tab ()
    "Complete common prefix, then cycle through completions."
    (interactive)
    (let ((completion-cycle-threshold 1))  ; Always cycle after first completion
      (if (and (eq last-command this-command)
               (> (length (all-completions
                          (field-string (field-beginning))
                          minibuffer-completion-table
                          minibuffer-completion-predicate)) 1))
          (vertico-next)  ; Cycle to next completion
        (minibuffer-complete))))  ; Complete common prefix first

  ;; Bind the smart TAB function
  (define-key vertico-map (kbd "TAB") #'my/vertico-smart-tab)
  (define-key vertico-map (kbd "<tab>") #'my/vertico-smart-tab))
#+end_src
*** Savehist

Persistence for minibuffer history across Emacs sessions. Essential for maintaining command history, search patterns, and completion preferences.

*Documentation:* =C-h f savehist-mode=
#+begin_src emacs-lisp
(use-package savehist
  :init
  (savehist-mode))
#+end_src
*** Emacs Minibuffer Settings

Enhanced minibuffer configuration that improves the completion experience. Enables recursive minibuffers, context menus, and better visual feedback for multi-completion commands.

*Features:*
- Recursive minibuffers for nested commands
- Visual indicator for multiple completion (CRM)
- Context menu support with mouse interaction
- Improved cursor behavior in minibuffer
#+begin_src emacs-lisp
(use-package emacs
  :init
  ;; enable context menu
  (context-menu-mode t)
  (setq enable-recursive-minibuffers t)
  (setq read-extended-command-predicate #'command-completion-default-include-p)
  (defun crm-indicator (args)
    (cons (format "[CRM%s] %s"
                  (replace-regexp-in-string
                   "\\`\\[.*?]\\*\\|\[.*?]\\*\\'" ""
                   crm-separator)
                  (car args))
          (cdr args)))
  (advice-add #'completing-read-multiple :filter-args #'crm-indicator)
  (setq minibuffer-prompt-properties
   '(read-only t cursor-intangible t face minibuffer-prompt))
  (add-hook 'minibuffer-setup-hook #'cursor-intangible-mode)
  )
#+end_src
** Orderless

Advanced completion matching that allows space-separated patterns in any order. Supports multiple matching styles including fuzzy, initialism, and regexp matching.

*Project:* [[https://github.com/oantolin/orderless][GitHub - oantolin/orderless]]
*Features:*
- Order-independent pattern matching
- Custom completion styles per category
- Advanced dispatchers for file and command completion
- Escapable space separator for literal matching

*Matching Examples:*
- =f/s/test= → file containing "f", "s", and "test"
- =init-el= → files/commands with initialism matching
- =test$= → items ending with "test"

*Documentation:* =C-h f orderless=, =C-h v completion-styles=
#+begin_src emacs-lisp
(use-package orderless
  :ensure t
  :init
  (defun +orderless-consult-dispatch (word _index _total)
    (cond
     ((string-suffix-p "$" word)
      `(orderless-regexp . ,(concat (substring word 0 -1) "[\x100000-\x10FFFF]*$")))
     ((and (or minibuffer-completing-file-name
               (derived-mode-p 'eshell-mode))
           (string-match-p "\\`\\.." word))
      `(orderless-regexp . ,(concat "\\." (substring word 1) "[\x100000-\x10FFFF]*$")))
     ((and (> (length word) 0) (eq (aref word 0) ?~))  ; Compatible replacement for string-prefix-p
      `(orderless-regexp . ,(concat (substring word 1) "[\x100000-\x10FFFF]*$")))))

  :config
  (orderless-define-completion-style +orderless-with-initialism
    (orderless-matching-styles '(orderless-initialism orderless-literal orderless-regexp)))

  :custom
  (completion-styles '(orderless basic))
  (completion-category-defaults nil)
  (completion-category-overrides
   '((file (styles basic partial-completion orderless))
     (command (styles +orderless-with-initialism))
     (variable (styles +orderless-with-initialism))
     (symbol (styles +orderless-with-initialism))))
  (orderless-component-separator #'orderless-escapable-split-on-space)
  (orderless-style-dispatchers (list #'+orderless-consult-dispatch)))
#+end_src
** Marginalia

Rich annotations for completion candidates. Provides contextual information like file sizes, command descriptions, variable types, and more in the completion interface.

*Project:* [[https://github.com/minad/marginalia][GitHub - minad/marginalia]]
*Features:*
- Automatic annotations for files, commands, variables
- Cycling through different annotation levels (M-A)
- Extensible annotation system
- Performance-optimized for large candidate lists

*Annotation Types:*
- File paths: sizes, dates, permissions
- Commands: key bindings, descriptions
- Variables: values, types, documentation
- Packages: versions, descriptions

*Documentation:* =C-h f marginalia-mode=, =C-h f marginalia-cycle=
#+begin_src emacs-lisp
(use-package marginalia
  :ensure t
  :bind (:map minibuffer-local-map
              ("M-A" . marginalia-cycle))
  :init
  (marginalia-mode)
  :custom
  (marginalia-max-relative-age 0)
  (marginalia-align 'right))
#+end_src
