.emacs.d/config.el

;; Make Vertico optional so startup isn't blocked when offline.
(use-package vertico
  :ensure t
  :custom
  (vertico-count 10)
  (vertico-resize nil)
  (vertico-cycle t)
  :init
  (vertico-mode 1)
  :bind (:map vertico-map
              ("TAB" . minibuffer-complete)  ; Complete common prefix first, then cycle
              ("<tab>" . minibuffer-complete)
              ("S-TAB" . vertico-previous)  ; Cycle backwards with Shift+TAB
              ("<backtab>" . vertico-previous)))

(unless (package-installed-p 'vertico)
  (message "Vertico not installed; using default completion UI (M-x package-install RET vertico RET)"))

;; Enhanced TAB completion behavior for vertico
(with-eval-after-load 'vertico
  ;; Configure completion to cycle through options after completing common prefix
  (setq completion-cycle-threshold 3)  ; Start cycling after 3 or fewer completions
  (setq completion-auto-help nil)      ; Don't show *Completions* buffer

  ;; Custom function for smart TAB completion
  (defun my/vertico-smart-tab ()
    "Complete common prefix, then cycle through completions."
    (interactive)
    (let ((completion-cycle-threshold 1))  ; Always cycle after first completion
      (if (and (eq last-command this-command)
               (> (length (all-completions
                          (field-string (field-beginning))
                          minibuffer-completion-table
                          minibuffer-completion-predicate)) 1))
          (vertico-next)  ; Cycle to next completion
        (minibuffer-complete))))  ; Complete common prefix first

  ;; Bind the smart TAB function
  (define-key vertico-map (kbd "TAB") #'my/vertico-smart-tab)
  (define-key vertico-map (kbd "<tab>") #'my/vertico-smart-tab))

(use-package savehist
  :init
  (savehist-mode))

(use-package emacs
  :init
  ;; enable context menu
  (context-menu-mode t)
  (setq enable-recursive-minibuffers t)
  (setq read-extended-command-predicate #'command-completion-default-include-p)
  (defun crm-indicator (args)
    (cons (format "[CRM%s] %s"
                  (replace-regexp-in-string
                   "\\`\\[.*?]\\*\\|\[.*?]\\*\\'" ""
                   crm-separator)
                  (car args))
          (cdr args)))
  (advice-add #'completing-read-multiple :filter-args #'crm-indicator)
  (setq minibuffer-prompt-properties
   '(read-only t cursor-intangible t face minibuffer-prompt))
  (add-hook 'minibuffer-setup-hook #'cursor-intangible-mode)
  )

(use-package orderless
  :ensure t
  :init
  (defun +orderless-consult-dispatch (word _index _total)
    (cond
     ((string-suffix-p "$" word)
      `(orderless-regexp . ,(concat (substring word 0 -1) "[\x100000-\x10FFFF]*$")))
     ((and (or minibuffer-completing-file-name
               (derived-mode-p 'eshell-mode))
           (string-match-p "\\`\\.." word))
      `(orderless-regexp . ,(concat "\\." (substring word 1) "[\x100000-\x10FFFF]*$")))
     ((and (> (length word) 0) (eq (aref word 0) ?~))  ; Compatible replacement for string-prefix-p
      `(orderless-regexp . ,(concat (substring word 1) "[\x100000-\x10FFFF]*$")))))

  :config
  (orderless-define-completion-style +orderless-with-initialism
    (orderless-matching-styles '(orderless-initialism orderless-literal orderless-regexp)))

  :custom
  (completion-styles '(orderless basic))
  (completion-category-defaults nil)
  (completion-category-overrides
   '((file (styles basic partial-completion orderless))
     (command (styles +orderless-with-initialism))
     (variable (styles +orderless-with-initialism))
     (symbol (styles +orderless-with-initialism))))
  (orderless-component-separator #'orderless-escapable-split-on-space)
  (orderless-style-dispatchers (list #'+orderless-consult-dispatch)))

(use-package marginalia
  :ensure t
  :bind (:map minibuffer-local-map
              ("M-A" . marginalia-cycle))
  :init
  (marginalia-mode)
  :custom
  (marginalia-max-relative-age 0)
  (marginalia-align 'right))

(use-package consult
  :ensure t
