.emacs.d/config.el

;; Enhanced search and navigation
(global-set-key (kbd "C-s") 'consult-line)
(global-set-key (kbd "C-c r") 'consult-recent-file)
(global-set-key (kbd "C-c b p") 'consult-project-buffer)
(global-set-key (kbd "M-/") #'completion-at-point)

;; File operations (C-c f prefix - move format to C-c F)
(global-set-key (kbd "C-c f f") 'find-file)
(global-set-key (kbd "C-c f r") 'consult-recent-file)
(global-set-key (kbd "C-c f s") 'save-buffer)
(global-set-key (kbd "C-c f S") 'save-some-buffers)
(global-set-key (kbd "C-c f d") 'dired)
(global-set-key (kbd "C-c f j") 'dired-jump)
(global-set-key (kbd "C-c f c") 'copy-file)
(global-set-key (kbd "C-c f R") 'rename-file)
(global-set-key (kbd "C-c f D") 'delete-file)

;; Buffer operations (keep C-c b, expand existing)
(global-set-key (kbd "C-c b b") 'consult-buffer)
(global-set-key (kbd "C-c b k") 'kill-buffer)
(global-set-key (kbd "C-c b r") 'revert-buffer)
(global-set-key (kbd "C-c b n") 'next-buffer)
(global-set-key (kbd "C-c b P") 'previous-buffer)  ; Capital P to avoid conflict with existing C-c b p
(global-set-key (kbd "C-c b s") 'save-buffer)
(global-set-key (kbd "C-c b i") 'ibuffer)

;; Window management (keep C-c w)
(global-set-key (kbd "C-c w s") 'split-window-below)
(global-set-key (kbd "C-c w v") 'split-window-right)
(global-set-key (kbd "C-c w d") 'delete-window)
(global-set-key (kbd "C-c w o") 'delete-other-windows)
(global-set-key (kbd "C-c w w") 'other-window)
(global-set-key (kbd "C-c w h") 'windmove-left)
(global-set-key (kbd "C-c w j") 'windmove-down)
(global-set-key (kbd "C-c w k") 'windmove-up)
(global-set-key (kbd "C-c w l") 'windmove-right)
(global-set-key (kbd "C-c w =") 'balance-windows)
(global-set-key (kbd "C-c w m") 'maximize-window)
(global-set-key (kbd "C-c w u") 'winner-undo)
(global-set-key (kbd "C-c w R") 'winner-redo)  ; Capital R to avoid conflicts

;; Text editing and manipulation (C-c e prefix - move org export to C-c E)
(global-set-key (kbd "C-c e l") 'downcase-word)
(global-set-key (kbd "C-c e u") 'upcase-word)
(global-set-key (kbd "C-c e c") 'capitalize-word)
(global-set-key (kbd "C-c e L") 'downcase-region)
(global-set-key (kbd "C-c e U") 'upcase-region)
(global-set-key (kbd "C-c e s") 'sort-lines)
(global-set-key (kbd "C-c e r") 'reverse-region)
(global-set-key (kbd "C-c e d") 'duplicate-line)
(global-set-key (kbd "C-c e k") 'kill-whole-line)
(global-set-key (kbd "C-c e w") 'delete-trailing-whitespace)
(global-set-key (kbd "C-c e i") 'indent-region)

;; Search and replace (C-c s prefix - move org super-agenda to C-c S)
(global-set-key (kbd "C-c s s") 'consult-line)
(global-set-key (kbd "C-c s r") 'query-replace)
(global-set-key (kbd "C-c s R") 'query-replace-regexp)
(global-set-key (kbd "C-c s g") 'consult-grep)
(global-set-key (kbd "C-c s G") 'consult-git-grep)
(global-set-key (kbd "C-c s i") 'consult-imenu)
(global-set-key (kbd "C-c s o") 'occur)
(global-set-key (kbd "C-c s m") 'consult-mark)

;; Toggles (C-c t prefix - expand existing)
(global-set-key (kbd "C-c t a") #'my/toggle-completion-auto)
(global-set-key (kbd "C-c t f") #'my/toggle-all-formatting)
(global-set-key (kbd "C-c t w") #'my/toggle-which-key)
(global-set-key (kbd "C-c t l") 'toggle-truncate-lines)
(global-set-key (kbd "C-c t n") 'display-line-numbers-mode)
(global-set-key (kbd "C-c t h") 'hl-line-mode)
(global-set-key (kbd "C-c t v") 'visual-line-mode)
(global-set-key (kbd "C-c t r") 'read-only-mode)

;; Help and documentation (C-c h prefix - move consult-history to C-c H)
(global-set-key (kbd "C-c h f") 'describe-function)
(global-set-key (kbd "C-c h v") 'describe-variable)
(global-set-key (kbd "C-c h k") 'describe-key)
(global-set-key (kbd "C-c h m") 'describe-mode)
(global-set-key (kbd "C-c h b") 'describe-bindings)
(global-set-key (kbd "C-c h a") 'apropos)
(global-set-key (kbd "C-c h i") 'info)
(global-set-key (kbd "C-c h w") 'where-is)

;; Less common functions moved to capitals
;; Format functions (move from C-c f to C-c F)
(global-set-key (kbd "C-c F") #'my/toggle-all-formatting)  ; Quick format toggle
;; History (move from C-c h to C-c H)
;; Info functions (move from C-c i to C-c I)
;; Macro functions (move from C-c k to C-c K)
;; Man pages (move from C-c m to C-c M)
;; Note: These will override existing package bindings - packages should be updated

;; Enhanced C-x bindings (traditional Emacs enhanced)
(global-set-key (kbd "C-x C-r") 'consult-recent-file)
(global-set-key (kbd "C-x C-j") 'dired-jump)
(global-set-key (kbd "C-x M-k") 'kill-buffer-and-window)
;; Note: C-x C-b is already used by perspective (persp-list-buffers)

;; Quick access shortcuts (avoiding conflicts)
;; Note: M-o is already used by ace-window
(global-set-key (kbd "M-K") 'kill-whole-line)  ; Capital K instead of M-k
(global-set-key (kbd "M-D") 'kill-word)
(global-set-key (kbd "M-j") 'join-line)
(global-set-key (kbd "M-z") 'zap-up-to-char)
(global-set-key (kbd "M-Z") 'zap-to-char)

;; Enable winner-mode for window configuration undo/redo
(winner-mode 1)

;; Utility functions for keybindings
(defun duplicate-line ()
  "Duplicate current line."
  (interactive)
  (let ((column (- (point) (point-at-bol)))
        (line (let ((s (thing-at-point 'line t)))
                (if (string-match "\\(.*\\)\n$" s) (match-string 1 s) s))))
    (move-end-of-line 1)
    (newline)
    (insert line)
    (move-beginning-of-line 1)
    (forward-char column)))

(defun reverse-region (beg end)
  "Reverse characters in region."
  (interactive "r")
  (let ((region (buffer-substring beg end)))
    (delete-region beg end)
    (insert (nreverse (string-to-list region)))))

(defun kill-buffer-and-window ()
  "Kill the current buffer and delete its window."
  (interactive)
  (kill-buffer)
  (delete-window))

(defun maximize-window ()
  "Maximize current window."
  (interactive)
  (delete-other-windows))
