.emacs.d/config.el

(use-package which-key
  :ensure t
  :init
  (which-key-mode)

  :custom
  ;; Appearance
  (which-key-popup-type 'side-window)    ; Show in side window
  (which-key-side-window-location 'bottom)
  (which-key-side-window-max-width 0.33)
  (which-key-side-window-max-height 0.25)
  (which-key-max-description-length 32)
  (which-key-max-display-columns nil)    ; Auto-calculate columns
  (which-key-min-display-lines 6)

  ;; Timing
  (which-key-idle-delay 0.5)             ; Show after 0.5 seconds
  (which-key-idle-secondary-delay 0.05)  ; Update quickly after first show

  ;; Behavior
  (which-key-sort-order 'which-key-key-order-alpha) ; Alphabetical order
  (which-key-sort-uppercase-first nil)
  (which-key-add-column-padding 1)
  (which-key-unicode-correction 3)
  (which-key-special-keys '("SPC" "TAB" "RET" "ESC" "DEL"))

  :config
  ;; Custom descriptions for better clarity
  (which-key-add-key-based-replacements
    ;; Global prefixes
    "C-c b p" "consult-project-buffer"
    "C-c r" "recent-file"
    "C-c p" "projectile"
    "C-c P" "projectile"
    "C-c g" "git/magit"
    "C-c l" "lsp/eglot"
    "C-c f" "format"
    "C-c c" "cape/completion"
    "C-c t" "toggle"
    "C-c o" "org"
    "C-c w" "window"
    "C-c b" "buffer"

    ;; Magit
    "C-c g c" "clone"
    "C-c g i" "init"
    "C-c g f" "find-file"
    "C-c g b" "blame"
    "C-c g l" "log-file"
    "C-c g p" "pull"
    "C-c g P" "push"
    "C-c g s" "stage-file"
    "C-c g u" "unstage-file"

    ;; Projectile
    "C-c P p" "switch-project"
    "C-c P f" "find-file"
    "C-c P b" "switch-buffer"
    "C-c P k" "kill-buffers"
    "C-c P D" "dired"
    "C-c P s" "search"
    "C-c P s g" "grep"
    "C-c P s r" "ripgrep"
    "C-c P r" "replace"
    "C-c P i" "invalidate-cache"

    ;; LSP/Eglot
    "C-c l a" "code-actions"
    "C-c l r" "rename"
    "C-c l f" "format"
    "C-c l h" "help/doc"
    "C-c l d" "definition"
    "C-c l D" "references"
    "C-c l s" "shutdown"
    "C-c l R" "reconnect"

    ;; Cape/Completion
    "C-c c p" "completion-at-point"
    "C-c c d" "dabbrev"
    "C-c c f" "file"
    "C-c c h" "history"
    "C-c c k" "keyword"
    "C-c c s" "elisp-symbol"

    ;; Toggle functions
    "C-c t a" "completion-auto"
    "C-c t f" "formatting"
    "C-c t w" "which-key"

    ;; Window/Project
    "C-c w o" "project-overview"

    ;; Org mode
    "C-c a" "agenda"
    "C-c x" "capture"
    "C-c l" "store-link"
    "C-c o" "org-hydra"
    "C-c n" "roam-hydra"

    ;; Org roam specific
    "C-c n f" "find-node"
    "C-c n i" "insert-node"
    "C-c n c" "capture-node"
    "C-c n t" "dailies-today"
    "C-c n g" "graph"

    ;; Org export
    "C-c e" "export"
    "C-c e p" "export-pdf"
    "C-c e d" "export-docx"
    "C-c e h" "export-hugo"
    "C-c e e" "export-menu"

    ;; Org QL (advanced queries)
    "C-c q" "org-ql"
    "C-c q q" "search"
    "C-c q v" "view"
    "C-c q t" "today-tasks"
    "C-c q n" "next-actions"
    "C-c q p" "projects"

    ;; Org download
    "C-c d" "download"
    "C-c d y" "yank-image"
    "C-c d s" "screenshot"
    "C-c d f" "image-file"
    "C-c d r" "rename"

    ;; Org cliplink
    "C-c L" "cliplink"
    "C-c C-L" "cliplink-metadata"

    ;; Org super agenda
    "C-c s" "super-agenda"
    "C-c s a" "toggle-mode"

    ;; Window management
    "M-o" "ace-window"
    "C-x o" "ace-window"
    "C-`" "popup-toggle"
    "M-`" "popup-cycle"
    "C-M-`" "popup-toggle-type"

    ;; Workspace management
    "C-c C-p" "perspective"
    "C-x C-b" "persp-list-buffers"

    ;; File management
    "C-x C-n" "dired-sidebar"
    "C-c d n" "deft-notes"

    ;; Enhanced completion
    "C-c c M-e" "cape-emoji"
    "C-c c M-d" "cape-dict"

    ;; Ansible
    "C-c a" "ansible"
    "C-c a d" "ansible-doc"
    "C-c a D" "ansible-doc-at-point"
    "C-c A" "ansible-hydra"

    ;; Table of Contents
    "C-c C-o" "insert-toc"
    "C-c C-u" "update-toc"
    "C-c t i" "toc-in-drawer"
    "C-c t e" "toc-export-options"
    "C-c t g" "github-style-toc"
    "C-c t o" "org-style-toc"

    ;; Formatting
    "C-c f f" "format-buffer"
    "C-c f r" "format-region"

    ;; Text manipulation
    "C-=" "expand-region"
    "C--" "contract-region"
    "C-M-=" "mark-outside-pairs"
    "C-c =" "mark-line-content"
    "C-," "embrace-commander"
    "C-c ," "embrace-change"
    "C-c ." "embrace-delete"
    "C-c f t" "toggle-format-mode")

  ;; Major mode specific descriptions
  (which-key-add-major-mode-key-based-replacements 'emacs-lisp-mode
    "C-c C-c" "eval-defun"
    "C-c C-e" "eval-last-sexp"
    "C-c C-r" "eval-region"
    "C-c C-b" "eval-buffer")

  (which-key-add-major-mode-key-based-replacements 'org-mode
    "C-c C-c" "ctrl-c-ctrl-c"
    "C-c C-t" "todo"
    "C-c C-s" "schedule"
    "C-c C-d" "deadline"
    "C-c a" "agenda")

  ;; Custom which-key groups for better organization
  (defun my/which-key-setup-groups ()
    "Set up which-key groups for better organization."
    (which-key-add-key-based-replacements
      ;; Movement and navigation
      "M-g" "goto"
      "M-s" "search"

      ;; Window management
      "C-x 0" "delete-window"
      "C-x 1" "delete-other-windows"
      "C-x 2" "split-window-below"
      "C-x 3" "split-window-right"
      "C-x o" "other-window"

      ;; Buffer management
      "C-x b" "switch-buffer"
      "C-x k" "kill-buffer"
      "C-x C-b" "list-buffers"

      ;; File operations
      "C-x C-f" "find-file"
      "C-x C-s" "save-buffer"
      "C-x C-w" "write-file"))

  (my/which-key-setup-groups)

  ;; Show help for specific prefixes immediately
  (which-key-add-key-based-replacements
    "C-h" "help"
    "C-x r" "rectangle/register"
    "C-x v" "version-control"
    "C-x 4" "other-window"
    "C-x 5" "other-frame"
    "<f1>" "cheatsheet"
    "C-h C-h" "cheatsheet")

  ;; Custom which-key functions
  (defun my/which-key-show-top-level ()
    "Show top level keys."
    (interactive)
    (which-key-show-top-level))

  (defun my/toggle-which-key ()
    "Toggle which-key mode."
    (interactive)
    (which-key-mode 'toggle)
    (message "which-key mode: %s" (if which-key-mode "enabled" "disabled")))

  (global-set-key (kbd "C-h C-k") #'my/which-key-show-top-level)
  (global-set-key (kbd "C-c t w") #'my/toggle-which-key))
