.emacs.d/config.org
** Eglot

Built-in Language Server Protocol (LSP) client that provides intelligent editing features like completion, diagnostics, navigation, and refactoring across multiple programming languages.

*Project:* [[https://github.com/joaotavora/eglot][GitHub - joaotavora/eglot]]
*Key Features:*
- Automatic LSP server detection and management
- Cross-language support with consistent interface
- Integration with Emacs' built-in systems (xref, eldoc, etc.)
- Minimal configuration required for most languages

*Essential Commands:*
| Key | Command | Purpose |
|-----|---------|---------|
| C-c l a | eglot-code-actions | Show available code actions |
| C-c l r | eglot-rename | Rename symbol across project |
| C-c l f | eglot-format-buffer | Format current buffer |
| C-c l d | xref-find-definitions | Go to definition |
| C-c l o | eglot-code-action-organize-imports | Organize imports |

*Supported Languages:*
Automatically configured for Python, JavaScript/TypeScript, Rust, Go, C/C++, Java, CSS, HTML, JSON, YAML, and shell scripts.

*Documentation:* =C-h f eglot-ensure=, =C-h i eglot=
#+begin_src emacs-lisp
(use-package eglot
  :hook
  ((python-mode python-ts-mode) . eglot-ensure)
  ((js-mode js-ts-mode typescript-mode typescript-ts-mode) . eglot-ensure)
  ((rust-mode rust-ts-mode) . eglot-ensure)
  ((go-mode go-ts-mode) . eglot-ensure)
  ((c-mode c-ts-mode c++-mode c++-ts-mode) . eglot-ensure)
  ((java-mode java-ts-mode) . eglot-ensure)
  ((css-mode css-ts-mode) . eglot-ensure)
  ((html-mode html-ts-mode) . eglot-ensure)
  ((json-mode json-ts-mode) . eglot-ensure)
  ((yaml-mode yaml-ts-mode) . (lambda ()
                                  ;; Only start eglot if it's not an Ansible file
                                  (unless (and (fboundp 'my/is-ansible-file)
                                               (my/is-ansible-file))
                                    (eglot-ensure))))
  ((sh-mode bash-ts-mode) . eglot-ensure)

  :bind (:map eglot-mode-map
              ("C-c l a" . eglot-code-actions)
              ("C-c l o" . eglot-code-action-organize-imports)
              ("C-c l r" . eglot-rename)
              ("C-c l f" . eglot-format-buffer)
              ("C-c l h" . eldoc)
              ("C-c l d" . xref-find-definitions)
              ("C-c l D" . xref-find-references)
              ("C-c l s" . eglot-shutdown)
              ("C-c l R" . eglot-reconnect))
  :custom
  (eglot-autoshutdown t)
  (eglot-confirm-server-initiated-edits nil)
  (eglot-events-buffer-size 0)

  :config
  (add-to-list 'eglot-server-programs
               '((python-mode python-ts-mode) . ("basedpyright")))
    (add-to-list 'eglot-server-programs
               '((rust-mode rust-ts-mode) . ("rust-analyzer")))

  (add-to-list 'eglot-server-programs
               '((js-mode js-ts-mode typescript-mode typescript-ts-mode)
                 . ("typescript-language-server" "--stdio")))

  (add-to-list 'eglot-server-programs
               '((go-mode go-ts-mode) . ("gopls")))

  (add-to-list 'eglot-server-programs
               '((c-mode c-ts-mode c++-mode c++-ts-mode) . ("clangd")))

  (setq eldoc-documentation-strategy 'eldoc-documentation-compose-eagerly)
  (defun my/eglot-organize-imports ()
    "Organize imports in the current buffer."
    (interactive)
    (when (eglot-current-server)
      (eglot-code-actions nil nil "source.organizeImports" t)))

  (defun my/eglot-format-buffer-before-save ()
    "Format buffer before save of eglot is active."
    (when (and (bound-and-true-p eglot--managed-mode)
               (eglot-current-server))
      (eglot-format-buffer)))

  (add-hook 'before-save-hook #'my/eglot-format-buffer-before-save))
#+end_src
** Flymake
#+begin_src emacs-lisp
(use-package flymake
  :hook
  (prog-mode . flymake-mode)

  :bind (:map flymake-mode-map
              ("C-c ! n" . flymake-goto-next-error)
              ("C-c ! p" . flymake-goto-prev-error)
              ("C-c ! l" . flymake-show-buffer-diagnostics)
              ("C-c ! L" . flymake-show-project-diagnostics))
  :custom
  (eldoc-idle-delay 0.1)
  (eldoc-echo-area-use-multiline-p 3)

  :config
  (when (display-graphic-p)
    (use-package eldoc-box
      :custom
  (eldoc-box-max-pixel-width 600)
  (eldoc-box-max-pixel-height 400))))

#+end_src
** Corfu
#+begin_src emacs-lisp
(use-package corfu
  :ensure t
  :custom
  ;; Completion behavior
  (corfu-cycle t)                ; Enable cycling for corfu-next/previous
  (corfu-auto t)                 ; Enable auto completion
  (corfu-auto-delay 0.0)         ; No delay for completion
  (corfu-auto-prefix 2)          ; Complete with 2 characters
  (corfu-separator ?\s)          ; Orderless field separator
  (corfu-quit-at-boundary 'separator) ; Never quit at completion boundary
  (corfu-quit-no-match 'separator)     ; Never quit if there is no match
  (corfu-preview-current 'insert)      ; Preview current candidate
  (corfu-preselect 'prompt)            ; Preselect the prompt
  (corfu-on-exact-match nil)           ; Don't auto expand exact matches
  (corfu-scroll-margin 5)              ; Scroll margin

  ;; UI customization
  (corfu-max-width 120)
  (corfu-min-width 20)
  (corfu-count 20)              ; Maximum number of candidates to show

  :bind
  (:map corfu-map
        ("TAB" . corfu-next)
        ([tab] . corfu-next)
        ("S-TAB" . corfu-previous)
        ([backtab] . corfu-previous)
        ("M-SPC" . corfu-insert-separator)  ; For orderless
        ("RET" . corfu-insert)
        ("M-d" . corfu-show-documentation)
        ("C-g" . corfu-quit))

  :init
  (global-corfu-mode)

  :config
  ;; Enable Corfu more generally for every minibuffer, as long as no other
  ;; completion UI is active. If you use Mct or Vertico as your main minibuffer
  ;; completion UI. From the Corfu README.
  (defun corfu-enable-always-in-minibuffer ()
    "Enable Corfu in the minibuffer if Vertico/Mct are not active."
    (unless (or (bound-and-true-p mct--active)
                (bound-and-true-p vertico--input)
                (eq (current-local-map) read-passwd-map))
      (setq-local corfu-echo-delay nil ;; Disable automatic echo and popup
                  corfu-popupinfo-delay nil)
      (corfu-mode 1)))
  (add-hook 'minibuffer-setup-hook #'corfu-enable-always-in-minibuffer 1)

  ;; Sort by input history (no need to install it separately)
  (with-eval-after-load 'savehist
    (corfu-history-mode 1)
    (add-to-list 'savehist-additional-variables 'corfu-history)))
#+end_src
*** corfu-popupinfo (built into corfu)
#+begin_src emacs-lisp
;; corfu-popupinfo is now built into corfu
(with-eval-after-load 'corfu
  (setq corfu-popupinfo-delay '(0.25 . 0.1))
  (setq corfu-popupinfo-hide nil)
  (corfu-popupinfo-mode 1))
#+end_src
*** nerd-icons-corfu
#+begin_src emacs-lisp
(use-package nerd-icons-corfu
  :after corfu
  :config
  (add-to-list 'corfu-margin-formatters #'nerd-icons-corfu-formatter))
#+end_src
