.emacs.d/config.el

(use-package cape
  :ensure t
  :bind (("C-c c p" . completion-at-point) ;; capf
         ("C-c c t" . complete-tag)        ;; etags
         ("C-c c d" . cape-dabbrev)        ;; dabbrev
         ("C-c c h" . cape-history)        ;; eshell/comint/minibuffer history
         ("C-c c f" . cape-file)           ;; file completion
         ("C-c c k" . cape-keyword)        ;; keyword/snipet
         ("C-c c s" . cape-elisp-symbol)   ;; elisp symbol
         ("C-c c e" . cape-elisp-block)    ;; elisp block
         ("C-c c a" . cape-abbrev)         ;; abbrev
         ("C-c c l" . cape-line)           ;; line completion
         ("C-c c w" . cape-dict)           ;; dict/words
         ("C-c c ::" . cape-tex)           ;; tex
         ("C-c c _" . cape-tex)            ;; tex
         ("C-c c ^" . cape-tex)            ;; tex
         ("C-c c &" . cape-sgml)           ;; sgml
         ("C-c c r" . cape-rfc1345))       ;; rfc1345

  :init
  ;; Add useful defaults to completion-at-point-functions
  (add-to-list 'completion-at-point-functions #'cape-dabbrev)
  (add-to-list 'completion-at-point-functions #'cape-file)
  (add-to-list 'completion-at-point-functions #'cape-elisp-block)
  ;; cape-emoji is available on Emacs 29+
  (when (> emacs-major-version 28)
    (add-to-list 'completion-at-point-functions #'cape-emoji))
  ;; cape-dict was deprecated in favor of cape-dict (Cape v0.17+)
  (when (fboundp 'cape-dict)
    (add-to-list 'completion-at-point-functions #'cape-dict))

  ;; Recommended additional backends for 2025
  (add-to-list 'completion-at-point-functions #'cape-abbrev)   ; User abbreviations
  (add-to-list 'completion-at-point-functions #'cape-line)    ; Line completion

  ;; Context-specific backends (added as needed)
  ;;(add-to-list 'completion-at-point-functions #'cape-history)  ; Enable in shells
  ;;(add-to-list 'completion-at-point-functions #'cape-keyword)  ; Programming keywords
  ;;(add-to-list 'completion-at-point-functions #'cape-elisp-symbol)  ; More elisp completion

  ;; Specialized backends - better as manual keybindings (see :bind section above)
  ;;(add-to-list 'completion-at-point-functions #'cape-tex)      ; TeX → Unicode
  ;;(add-to-list 'completion-at-point-functions #'cape-sgml)     ; SGML → Unicode
  ;;(add-to-list 'completion-at-point-functions #'cape-rfc1345)  ; RFC1345 → Unicode

  :config
  ;; Silence the pcomplete capf, no errors or messages!
  (advice-add 'pcomplete-completions-at-point :around #'cape-wrap-silent)

  ;; Ensure that pcomplete does not write to the buffer
  (advice-add 'pcomplete-completions-at-point :around #'cape-wrap-purify)

  ;; Add conditional keybindings for optional cape functions
  (when (> emacs-major-version 28)
    (global-set-key (kbd "C-c c M-e") #'cape-emoji))
  (when (fboundp 'cape-dict)
    (global-set-key (kbd "C-c c M-d") #'cape-dict))  ; Replaces deprecated cape-ispell

  ;; Use Cape's super-capf for better completion
  (setq-local completion-at-point-functions
              (list (cape-capf-super
                     #'cape-dabbrev
                     #'cape-file
                     #'cape-elisp-block))))

(use-package prescient
  :custom
  (prescient-aggressive-file-save t)
  (prescient-save-file "~/.config/emacs/prescient-save.el")
  :config
  (prescient-persist-mode 1))

(use-package corfu-prescient
  :after (corfu prescient)
  :config
  (corfu-prescient-mode 1))

(use-package python-mode
  :mode "\\.py\\'"
  :hook
  (python-mode . (lambda ()
                   (setq-local cape-dabbrev-min-length 3)
                   (add-to-list 'completion-at-point-functions #'cape-keyword t))))

;; Base keybindings for all programming modes
(defun my/setup-prog-mode-keybindings ()
  "Set up common programming mode keybindings."
  ;; LSP/Language Server actions (C-c l prefix)
  (when (bound-and-true-p eglot--managed-mode)
    (local-set-key (kbd "C-c l d") 'eglot-find-declaration)
    (local-set-key (kbd "C-c l D") 'eglot-find-definition)
    (local-set-key (kbd "C-c l r") 'eglot-find-references)
    (local-set-key (kbd "C-c l i") 'eglot-find-implementation)
    (local-set-key (kbd "C-c l t") 'eglot-find-typeDefinition)
    (local-set-key (kbd "C-c l s") 'eglot-workspace-symbols)
    (local-set-key (kbd "C-c l S") 'consult-eglot-symbols)
    (local-set-key (kbd "C-c l R") 'eglot-rename)
    (local-set-key (kbd "C-c l a") 'eglot-code-actions)
    (local-set-key (kbd "C-c l f") 'eglot-format)
    (local-set-key (kbd "C-c l F") 'eglot-format-buffer)
    (local-set-key (kbd "C-c l h") 'eldoc)
    (local-set-key (kbd "C-c l =") 'eglot-format-buffer))

  ;; Code/Compile actions (C-c c prefix)
  (local-set-key (kbd "C-c c c") 'compile)
  (local-set-key (kbd "C-c c r") 'recompile)
  (local-set-key (kbd "C-c c f") 'apheleia-format-buffer)
  (local-set-key (kbd "C-c c R") 'apheleia-format-region)

  ;; Documentation (C-c d prefix - move org-download elsewhere)
  (local-set-key (kbd "C-c d d") 'eldoc)
  (local-set-key (kbd "C-c d h") 'eldoc-doc-buffer)
  (local-set-key (kbd "C-c d a") 'apropos)

  ;; REPL/Run (C-c r prefix - will override consult-recent-file in prog modes)
  (local-set-key (kbd "C-c r r") 'eval-last-sexp)  ; Default for lisp modes
  (local-set-key (kbd "C-c r b") 'eval-buffer)
  (local-set-key (kbd "C-c r e") 'eval-expression)

  ;; Import/Insert (C-c i prefix - move consult-info elsewhere)
  (local-set-key (kbd "C-c i i") 'yas-insert-snippet)
  (local-set-key (kbd "C-c i s") 'yas-visit-snippet-file))

;; Apply to all programming modes
(add-hook 'prog-mode-hook #'my/setup-prog-mode-keybindings)

(defun my/setup-python-keybindings ()
  "Python-specific keybindings inspired by Doom Emacs."
  ;; REPL interactions
  (local-set-key (kbd "C-c r r") 'run-python)
  (local-set-key (kbd "C-c r s") 'python-shell-send-statement)
  (local-set-key (kbd "C-c r d") 'python-shell-send-defun)
  (local-set-key (kbd "C-c r f") 'python-shell-send-file)
  (local-set-key (kbd "C-c r b") 'python-shell-send-buffer)
  (local-set-key (kbd "C-c r R") 'python-shell-send-region)

  ;; Testing (if pytest is available)
  (when (executable-find "pytest")
    (local-set-key (kbd "C-c c t") 'python-pytest)
    (local-set-key (kbd "C-c c T") 'python-pytest-file-dwim))

  ;; Virtual environments
  (local-set-key (kbd "C-c v a") 'pyvenv-activate)
  (local-set-key (kbd "C-c v d") 'pyvenv-deactivate)
  (local-set-key (kbd "C-c v w") 'pyvenv-workon)

  ;; Import sorting (if isort available)
  (when (executable-find "isort")
    (local-set-key (kbd "C-c i s") 'python-isort-buffer)
    (local-set-key (kbd "C-c i r") 'python-isort-region)))

(add-hook 'python-mode-hook #'my/setup-python-keybindings)
(add-hook 'python-ts-mode-hook #'my/setup-python-keybindings)
