.emacs.d/config.org
*** JavaScript/TypeScript Mode Specific
#+begin_src emacs-lisp
(defun my/setup-js-keybindings ()
  "JavaScript/TypeScript-specific keybindings."
  ;; Node.js REPL
  (when (executable-find "node")
    (local-set-key (kbd "C-c r r") 'nodejs-repl)
    (local-set-key (kbd "C-c r s") 'nodejs-repl-send-last-expression)
    (local-set-key (kbd "C-c r d") 'nodejs-repl-send-line)
    (local-set-key (kbd "C-c r R") 'nodejs-repl-send-region)
    (local-set-key (kbd "C-c r b") 'nodejs-repl-send-buffer))

  ;; npm/yarn commands
  (local-set-key (kbd "C-c n i") (lambda () (interactive) (compile "npm install")))
  (local-set-key (kbd "C-c n s") (lambda () (interactive) (compile "npm start")))
  (local-set-key (kbd "C-c n t") (lambda () (interactive) (compile "npm test")))
  (local-set-key (kbd "C-c n b") (lambda () (interactive) (compile "npm run build")))
  (local-set-key (kbd "C-c n r") 'npm-mode)  ; if npm-mode available

  ;; Import helpers
  (local-set-key (kbd "C-c i a") 'js-import-path-add)  ; if available
  (local-set-key (kbd "C-c i o") 'js2-mode-toggle-hide-functions)  ; code folding

  ;; Documentation
  (local-set-key (kbd "C-c d m") (lambda () (interactive)
                                   (browse-url "https://developer.mozilla.org/en-US/"))))

(add-hook 'js-mode-hook #'my/setup-js-keybindings)
(add-hook 'js2-mode-hook #'my/setup-js-keybindings)
(add-hook 'js-ts-mode-hook #'my/setup-js-keybindings)
(add-hook 'typescript-mode-hook #'my/setup-js-keybindings)
(add-hook 'typescript-ts-mode-hook #'my/setup-js-keybindings)
#+end_src

*** Rust Mode Specific
#+begin_src emacs-lisp
(defun my/setup-rust-keybindings ()
  "Rust-specific keybindings inspired by Doom Emacs."
  ;; Cargo commands
  (local-set-key (kbd "C-c c b") 'rust-compile)
  (local-set-key (kbd "C-c c t") 'rust-test)
  (local-set-key (kbd "C-c c r") 'rust-run)
  (local-set-key (kbd "C-c c C") 'rust-check)
  (local-set-key (kbd "C-c c c") (lambda () (interactive) (compile "cargo build")))
  (local-set-key (kbd "C-c c R") (lambda () (interactive) (compile "cargo run")))

  ;; Cargo project commands
  (local-set-key (kbd "C-c p n") (lambda () (interactive) (compile "cargo new")))
  (local-set-key (kbd "C-c p i") (lambda () (interactive) (compile "cargo init")))
  (local-set-key (kbd "C-c p u") (lambda () (interactive) (compile "cargo update")))

  ;; Clippy (Rust linter)
  (when (executable-find "cargo-clippy")
    (local-set-key (kbd "C-c c l") (lambda () (interactive) (compile "cargo clippy"))))

  ;; Documentation
  (local-set-key (kbd "C-c d d") 'rust-dbg-wrap-or-unwrap)
  (local-set-key (kbd "C-c d o") (lambda () (interactive) (compile "cargo doc --open")))

  ;; Format
  (when (executable-find "rustfmt")
    (local-set-key (kbd "C-c c f") 'rust-format-buffer)))

(add-hook 'rust-mode-hook #'my/setup-rust-keybindings)
(add-hook 'rust-ts-mode-hook #'my/setup-rust-keybindings)
#+end_src

*** Web Development Mode Specific
#+begin_src emacs-lisp
(defun my/setup-web-keybindings ()
  "Web development keybindings for HTML/CSS/web-mode."
  ;; Tag navigation and manipulation
  (local-set-key (kbd "C-c t n") 'web-mode-tag-next)
  (local-set-key (kbd "C-c t p") 'web-mode-tag-previous)
  (local-set-key (kbd "C-c t s") 'web-mode-tag-select)
  (local-set-key (kbd "C-c t k") 'web-mode-tag-kill)

  ;; Element operations
  (local-set-key (kbd "C-c e w") 'web-mode-element-wrap)
  (local-set-key (kbd "C-c e k") 'web-mode-element-kill)
  (local-set-key (kbd "C-c e c") 'web-mode-element-clone)
  (local-set-key (kbd "C-c e r") 'web-mode-element-rename)

  ;; Attribute operations
  (local-set-key (kbd "C-c a n") 'web-mode-attribute-next)
  (local-set-key (kbd "C-c a k") 'web-mode-attribute-kill)
  (local-set-key (kbd "C-c a s") 'web-mode-attribute-select)

  ;; Live reload (if available)
  (local-set-key (kbd "C-c l r") 'web-mode-reload)

  ;; Documentation
  (local-set-key (kbd "C-c d h") (lambda () (interactive)
                                   (browse-url "https://developer.mozilla.org/en-US/"))))

(add-hook 'web-mode-hook #'my/setup-web-keybindings)
(add-hook 'html-mode-hook #'my/setup-web-keybindings)
(add-hook 'css-mode-hook #'my/setup-web-keybindings)
#+end_src

*** Ansible Mode Specific
#+begin_src emacs-lisp
(defun my/setup-ansible-keybindings ()
  "Ansible-specific keybindings inspired by Doom Emacs."
  ;; Documentation and help
  (local-set-key (kbd "C-c d d") 'ansible-doc)
  (local-set-key (kbd "C-c d a") 'ansible-doc-at-point)
  (local-set-key (kbd "C-c d m") (lambda () (interactive) (ansible-doc "")))

  ;; Vault operations
  (local-set-key (kbd "C-c v e") 'ansible-vault-encrypt-buffer)
  (local-set-key (kbd "C-c v d") 'ansible-vault-decrypt-buffer)
  (local-set-key (kbd "C-c v v") 'ansible-vault-view-file)

  ;; Execution and testing
  (local-set-key (kbd "C-c c p") (lambda () (interactive)
                                   (compile (read-string "Ansible playbook: " "ansible-playbook "))))
  (local-set-key (kbd "C-c c t") (lambda () (interactive)
                                   (compile (read-string "Ansible task: " "ansible "))))
  (local-set-key (kbd "C-c c c") (lambda () (interactive)
                                   (compile (read-string "Ansible check: " "ansible-playbook --check "))))
  (local-set-key (kbd "C-c c s") (lambda () (interactive)
                                   (compile "ansible-playbook --syntax-check site.yml")))

  ;; Navigation helpers
  (local-set-key (kbd "C-c g r") (lambda () (interactive) (find-file "roles/")))
  (local-set-key (kbd "C-c g t") (lambda () (interactive) (find-file "tasks/")))
  (local-set-key (kbd "C-c g v") (lambda () (interactive) (find-file "vars/")))
  (local-set-key (kbd "C-c g i") (lambda () (interactive) (find-file "inventory")))

  ;; Quick hydra access
  (local-set-key (kbd "C-c A") 'hydra-ansible/body))

(add-hook 'ansible-mode-hook #'my/setup-ansible-keybindings)
(add-hook 'poly-ansible-mode-hook #'my/setup-ansible-keybindings)
#+end_src
*** JavaScript/TypeScript
#+begin_src emacs-lisp
(use-package js2-mode
  :mode "\\.js\\'"
  :hook
  (js2-mode . (lambda ()
                (setq-local cape-dabbrev-min-length 2))))
#+end_src
*** Web
#+begin_src emacs-lisp
(use-package web-mode
  :ensure t
  :mode ("\\.html\\'" "\\.css\\'" "\\.scss\\'" "\\.jsx\\'" "\\.tsx\\'")
  :hook
  (web-mode . (lambda ()
                (add-to-list 'completion-at-point-functions #'cape-dabbrev t)
                (add-to-list 'completion-at-point-functions #'cape-keyword t))))
#+end_src

