.emacs.d/config.el

(defun my/setup-js-keybindings ()
  "JavaScript/TypeScript-specific keybindings."
  ;; Node.js REPL
  (when (executable-find "node")
    (local-set-key (kbd "C-c r r") 'nodejs-repl)
    (local-set-key (kbd "C-c r s") 'nodejs-repl-send-last-expression)
    (local-set-key (kbd "C-c r d") 'nodejs-repl-send-line)
    (local-set-key (kbd "C-c r R") 'nodejs-repl-send-region)
    (local-set-key (kbd "C-c r b") 'nodejs-repl-send-buffer))

  ;; npm/yarn commands
  (local-set-key (kbd "C-c n i") (lambda () (interactive) (compile "npm install")))
  (local-set-key (kbd "C-c n s") (lambda () (interactive) (compile "npm start")))
  (local-set-key (kbd "C-c n t") (lambda () (interactive) (compile "npm test")))
  (local-set-key (kbd "C-c n b") (lambda () (interactive) (compile "npm run build")))
  (local-set-key (kbd "C-c n r") 'npm-mode)  ; if npm-mode available

  ;; Import helpers
  (local-set-key (kbd "C-c i a") 'js-import-path-add)  ; if available
  (local-set-key (kbd "C-c i o") 'js2-mode-toggle-hide-functions)  ; code folding

  ;; Documentation
  (local-set-key (kbd "C-c d m") (lambda () (interactive)
                                   (browse-url "https://developer.mozilla.org/en-US/"))))

(add-hook 'js-mode-hook #'my/setup-js-keybindings)
(add-hook 'js2-mode-hook #'my/setup-js-keybindings)
(add-hook 'js-ts-mode-hook #'my/setup-js-keybindings)
(add-hook 'typescript-mode-hook #'my/setup-js-keybindings)
(add-hook 'typescript-ts-mode-hook #'my/setup-js-keybindings)

(defun my/setup-rust-keybindings ()
  "Rust-specific keybindings inspired by Doom Emacs."
  ;; Cargo commands
  (local-set-key (kbd "C-c c b") 'rust-compile)
  (local-set-key (kbd "C-c c t") 'rust-test)
  (local-set-key (kbd "C-c c r") 'rust-run)
  (local-set-key (kbd "C-c c C") 'rust-check)
  (local-set-key (kbd "C-c c c") (lambda () (interactive) (compile "cargo build")))
  (local-set-key (kbd "C-c c R") (lambda () (interactive) (compile "cargo run")))

  ;; Cargo project commands
  (local-set-key (kbd "C-c p n") (lambda () (interactive) (compile "cargo new")))
  (local-set-key (kbd "C-c p i") (lambda () (interactive) (compile "cargo init")))
  (local-set-key (kbd "C-c p u") (lambda () (interactive) (compile "cargo update")))

  ;; Clippy (Rust linter)
  (when (executable-find "cargo-clippy")
    (local-set-key (kbd "C-c c l") (lambda () (interactive) (compile "cargo clippy"))))

  ;; Documentation
  (local-set-key (kbd "C-c d d") 'rust-dbg-wrap-or-unwrap)
  (local-set-key (kbd "C-c d o") (lambda () (interactive) (compile "cargo doc --open")))

  ;; Format
  (when (executable-find "rustfmt")
    (local-set-key (kbd "C-c c f") 'rust-format-buffer)))

(add-hook 'rust-mode-hook #'my/setup-rust-keybindings)
(add-hook 'rust-ts-mode-hook #'my/setup-rust-keybindings)

(defun my/setup-web-keybindings ()
  "Web development keybindings for HTML/CSS/web-mode."
  ;; Tag navigation and manipulation
  (local-set-key (kbd "C-c t n") 'web-mode-tag-next)
  (local-set-key (kbd "C-c t p") 'web-mode-tag-previous)
  (local-set-key (kbd "C-c t s") 'web-mode-tag-select)
  (local-set-key (kbd "C-c t k") 'web-mode-tag-kill)

  ;; Element operations
  (local-set-key (kbd "C-c e w") 'web-mode-element-wrap)
  (local-set-key (kbd "C-c e k") 'web-mode-element-kill)
  (local-set-key (kbd "C-c e c") 'web-mode-element-clone)
  (local-set-key (kbd "C-c e r") 'web-mode-element-rename)

  ;; Attribute operations
  (local-set-key (kbd "C-c a n") 'web-mode-attribute-next)
  (local-set-key (kbd "C-c a k") 'web-mode-attribute-kill)
  (local-set-key (kbd "C-c a s") 'web-mode-attribute-select)

  ;; Live reload (if available)
  (local-set-key (kbd "C-c l r") 'web-mode-reload)

  ;; Documentation
  (local-set-key (kbd "C-c d h") (lambda () (interactive)
                                   (browse-url "https://developer.mozilla.org/en-US/"))))

(add-hook 'web-mode-hook #'my/setup-web-keybindings)
(add-hook 'html-mode-hook #'my/setup-web-keybindings)
(add-hook 'css-mode-hook #'my/setup-web-keybindings)

(use-package js2-mode
  :mode "\\.js\\'"
  :hook
  (js2-mode . (lambda ()
                (setq-local cape-dabbrev-min-length 2))))

(use-package web-mode
  :ensure t
  :mode ("\\.html\\'" "\\.css\\'" "\\.scss\\'" "\\.jsx\\'" "\\.tsx\\'")
  :hook
  (web-mode . (lambda ()
                (add-to-list 'completion-at-point-functions #'cape-dabbrev t)
                (add-to-list 'completion-at-point-functions #'cape-keyword t))))
