.emacs.d/config.el

(use-package markdown-mode
  :ensure t
  :mode (("README\\.md\\'" . gfm-mode)
         ("\\.md\\'" . markdown-mode)
         ("\\.markdown\\'" . markdown-mode))
  :custom
  (markdown-command "multimarkdown"))

(use-package dockerfile-mode
  :ensure t
  :mode "Dockerfile\\'")

(use-package yaml-mode
  :ensure t
  :mode ("\\.ya?ml\\'" "\\.yml\\'"))

(use-package toml-mode
  :ensure t
  :mode "\\.toml\\'")

(use-package json-mode
  :ensure t
  :mode "\\.json\\'")

(use-package ansible
  :ensure t
  :hook ((yaml-mode . ansible)
         (ansible . ansible-auto-decrypt-encrypt))
  :custom
  (ansible-vault-password-file "~/.ansible-vault")  ; Adjust path as needed
  :config
  ;; Auto-detect Ansible files
  (add-to-list 'auto-mode-alist '("/\\(group\\|host\\)_vars/" . yaml-mode))
  (add-to-list 'auto-mode-alist '("/playbooks/.*\\.ya?ml\\'" . yaml-mode))
  (add-to-list 'auto-mode-alist '("/roles/.*/tasks/.*\\.ya?ml\\'" . yaml-mode))
  (add-to-list 'auto-mode-alist '("/roles/.*/handlers/.*\\.ya?ml\\'" . yaml-mode))
  (add-to-list 'auto-mode-alist '("/roles/.*/vars/.*\\.ya?ml\\'" . yaml-mode))
  (add-to-list 'auto-mode-alist '("/roles/.*/defaults/.*\\.ya?ml\\'" . yaml-mode))
  (add-to-list 'auto-mode-alist '("/roles/.*/meta/.*\\.ya?ml\\'" . yaml-mode))
  (add-to-list 'auto-mode-alist '("ansible.*\\.cfg\\'" . conf-mode))
  (add-to-list 'auto-mode-alist '("inventory\\'" . conf-mode))
  (add-to-list 'auto-mode-alist '("\\.j2\\'" . jinja2-mode)))

(use-package ansible-doc
  :ensure t
  :after ansible
  :bind (:map yaml-mode-map
              ("C-c a d" . ansible-doc)
              ("C-c a D" . ansible-doc-at-point))
  :custom
  (ansible-doc-use-help-window t))

(use-package jinja2-mode
  :ensure t
  :mode "\\.j2\\'")

(use-package company-ansible
  :ensure t
  :after (company ansible)
  :config
  (add-to-list 'company-backends 'company-ansible))

(use-package yasnippet
  :ensure t
  :hook (prog-mode . yas-minor-mode)
  :config
  (yas-reload-all)

  ;; Enhanced cape-yasnippet function for better corfu integration
  (defun my/cape-yasnippet ()
    "Cape function for yasnippet with better annotation."
    (when (bound-and-true-p yas-minor-mode)
      (let ((table (yas--get-snippet-tables)))
        (when table
          (cape-wrap-annotation
           (cape-wrap-silent
            (cape-capf-buster #'yasnippet-capf))
           "Snippet")))))

  ;; Add yasnippet to completion-at-point-functions with higher priority
  (add-to-list 'completion-at-point-functions #'my/cape-yasnippet)

  ;; Smart TAB that handles yasnippet fields, expansion, and corfu
  (defun my/smart-tab ()
    "Smart TAB: navigate yasnippet fields, expand snippets, or use corfu."
    (interactive)
    (cond
     ;; If we're in a yasnippet field, move to next field or exit snippet
     ((and (bound-and-true-p yas-minor-mode)
           (yas-active-snippets))
      (yas-next-field-or-maybe-expand))
     ;; If yasnippet can expand at point, do it
     ((and (bound-and-true-p yas-minor-mode)
           (yas-expand-from-trigger-key)))
     ;; If corfu is active, navigate
     ((and (bound-and-true-p corfu-mode)
           corfu--candidates)
      (corfu-next))
     ;; Otherwise, try completion or indent
     (t (completion-at-point))))

  (defun my/smart-shift-tab ()
    "Smart Shift-TAB: navigate yasnippet fields backward, corfu backward, or unindent."
    (interactive)
    (cond
     ;; If we're in a yasnippet field, move to previous field
     ((and (bound-and-true-p yas-minor-mode)
           (yas-active-snippets))
      (yas-prev-field))
     ;; If corfu is active, navigate backward
     ((and (bound-and-true-p corfu-mode)
           corfu--candidates)
      (corfu-previous))
     ;; Otherwise, unindent
     (t (indent-for-tab-command))))

  ;; Override corfu TAB bindings for smarter behavior
  (with-eval-after-load 'corfu
    (define-key corfu-map (kbd "TAB") #'my/smart-tab)
    (define-key corfu-map (kbd "<tab>") #'my/smart-tab)
    (define-key corfu-map (kbd "S-TAB") #'my/smart-shift-tab)
    (define-key corfu-map (kbd "<backtab>") #'my/smart-shift-tab))

  ;; Global TAB behavior for programming modes
  (add-hook 'prog-mode-hook
            (lambda ()
              (local-set-key (kbd "TAB") #'my/smart-tab)
              (local-set-key (kbd "<tab>") #'my/smart-tab)
              (local-set-key (kbd "S-TAB") #'my/smart-shift-tab)
              (local-set-key (kbd "<backtab>") #'my/smart-shift-tab))))

;; Additional snippet collections
(use-package yasnippet-snippets
  :ensure t
  :after yasnippet
  :config
  (yasnippet-snippets-initialize))

(with-eval-after-load 'yasnippet
  (defun my/try-install-snippet-pack (pkg lib-name)
    "Try to install snippet package PKG and add its snippets if present.
LIB-NAME is the library file to `locate-library' (often the same as PKG)."
    (condition-case _
        (progn
          ;; Only install if present in archives to avoid long refreshes.
          (when (and (not (package-installed-p pkg))
                     (assq pkg package-archive-contents))
            (package-install pkg))
          (when-let ((lib (locate-library lib-name)))
            ;; Add its embedded snippets directory if it exists.
            (let* ((base (file-name-directory lib))
                   (snip (expand-file-name "snippets" base)))
              (when (file-directory-p snip)
                (add-to-list 'yas-snippet-dirs snip)))))
      (error (message "Skipping %s snippets (not available)." pkg)))

  ;; Curated packs aligned with languages in this config
  (my/try-install-snippet-pack 'go-snippets "go-snippets")
  (my/try-install-snippet-pack 'rust-snippets "rust-snippets")

  ;; Reload to pick up any newly added snippet dirs
  (when (bound-and-true-p yas-minor-mode)
    (yas-reload-all))))
