.emacs.d/config.el

;; Make yasnippet play nicely with Corfu navigation keys.
(with-eval-after-load 'yasnippet
  ;; Let Corfu own TAB in the popup; use yas field navigation while expanding.
  (define-key yas-minor-mode-map (kbd "<tab>") nil)
  (define-key yas-minor-mode-map (kbd "TAB") nil)
  (define-key yas-keymap (kbd "<tab>") #'yas-next-field)
  (define-key yas-keymap (kbd "S-<tab>") #'yas-prev-field)

  ;; Handy snippet keys when you want them explicitly.
  (global-set-key (kbd "C-c y y") #'yas-insert-snippet)
  (global-set-key (kbd "C-c y n") #'yas-new-snippet)
  (global-set-key (kbd "C-c y v") #'yas-visit-snippet-file))

;; Ensure the yasnippet CAPF is available alongside LSP and other backends.
(with-eval-after-load 'cape
  (defun my/enable-yas-capf ()
    "Append Yasnippet CAPF to `completion-at-point-functions' in this buffer."
    (when (bound-and-true-p yas-minor-mode)
      (add-to-list 'completion-at-point-functions #'my/cape-yasnippet t t)))

  ;; Add in common editing modes; respects buffers where yas is enabled.
  (dolist (hook '(prog-mode-hook text-mode-hook conf-mode-hook))
    (add-hook hook #'my/enable-yas-capf)))

;; When Eglot attaches, ensure yas CAPF is present too.
(with-eval-after-load 'eglot
  (add-hook 'eglot-managed-mode-hook #'my/enable-yas-capf))

(defun my/toggle-completion-auto ()
  "Toggle corfu auto completion."
  (interactive)
  (setq corfu-auto (not corfu-auto))
  (message "Corfu auto completion: %s" (if corfu-auto "enabled" "disabled")))

(defun my/completion-help ()
  "Show help for completion at point."
  (interactive)
  (when-let* ((candidate (and corfu--candidates
                              (>= corfu--index 0)
                              (nth corfu--index corfu--candidates))))
    (describe-symbol (intern candidate))))

(setq read-process-output-max (* 1024 1024))

(with-eval-after-load 'eshell
  (add-hook 'eshell-mode-hook
            (lambda ()
              (setq-local corfu-auto nil)
              (add-to-list 'completion-at-point-functions #'cape-history t))))

(defun my/eglot-modeline ()
  "Display current eglot server in modeline."
  (when (and (bound-and-true-p eglot--managed-mode)
             (eglot-current-server))
    (format " LSP[%s]" (eglot--server-nickname (eglot-current-server)))))

(add-to-list 'mode-line-misc-info
             '(:eval (my/eglot-modeline)))

;; Enable electric-pair-mode globally
(electric-pair-mode 1)

;; Customize electric-pair behavior
(setq electric-pair-pairs
      '((?\{ . ?\})
        (?\( . ?\))
        (?\[ . ?\])
        (?\" . ?\")
        (?\' . ?\')))

;; Preserve existing behavior in org-mode
(add-hook 'org-mode-hook
          (lambda ()
            ;; Only set electric-pair-inhibit-predicate if it exists (Emacs 24.4+)
            (when (boundp 'electric-pair-inhibit-predicate)
              (setq-local electric-pair-inhibit-predicate
                          `(lambda (c)
                             (if (char-equal c ?<) t (,electric-pair-inhibit-predicate c)))))))

(use-package smartparens
  :ensure t
  :hook ((prog-mode text-mode markdown-mode) . smartparens-mode)
  :bind (;; Navigation
         ("C-M-f" . sp-forward-sexp)
         ("C-M-b" . sp-backward-sexp)
         ("C-M-u" . sp-backward-up-sexp)
         ("C-M-d" . sp-down-sexp)
         ("C-M-n" . sp-next-sexp)
         ("C-M-p" . sp-previous-sexp)

         ;; Manipulation
         ("C-M-k" . sp-kill-sexp)
         ("C-M-w" . sp-copy-sexp)
         ("M-s" . sp-splice-sexp)
         ("M-r" . sp-raise-sexp)
         ("M-(" . sp-wrap-round)
         ("M-[" . sp-wrap-square)
         ("M-{" . sp-wrap-curly)

         ;; Slurping and barfing
         ("C-<right>" . sp-forward-slurp-sexp)
         ("C-<left>" . sp-forward-barf-sexp)
         ("C-M-<left>" . sp-backward-slurp-sexp)
         ("C-M-<right>" . sp-backward-barf-sexp))

  :config
  ;; Load default smartparens configuration
  (require 'smartparens-config)

  ;; Enable strict mode for Lisp-like languages
  (add-hook 'emacs-lisp-mode-hook #'smartparens-strict-mode)
  (add-hook 'lisp-mode-hook #'smartparens-strict-mode)
  (add-hook 'scheme-mode-hook #'smartparens-strict-mode)

  ;; Custom configurations for specific modes
  (sp-with-modes '(markdown-mode gfm-mode rst-mode)
    (sp-local-pair "*" "*")
    (sp-local-pair "**" "**")
    (sp-local-pair "_" "_"))

  ;; Web mode customizations
  (sp-with-modes '(web-mode html-mode)
    (sp-local-pair "<" ">"))

  ;; Show matching parens
  (show-paren-mode 1)
  (setq show-paren-delay 0))

(use-package expand-region
  :ensure t
  :bind (("C-=" . er/expand-region)
         ("C--" . er/contract-region)
         ("C-M-=" . er/mark-outside-pairs))
  :config
  ;; Add custom expansions
  (defun my/mark-line-content ()
    "Mark content of current line, excluding indentation."
    (interactive)
    (back-to-indentation)
    (set-mark (point))
    (end-of-line))

  ;; Bind to custom expansion
  (global-set-key (kbd "C-c =") #'my/mark-line-content))

(use-package embrace
  :ensure t
  :bind (("C-," . embrace-commander)
         ("C-c ," . embrace-change)
         ("C-c ." . embrace-delete))
  :config
  ;; Add custom embrace pairs
  (add-hook 'org-mode-hook 'embrace-org-mode-hook)
  (add-hook 'LaTeX-mode-hook 'embrace-LaTeX-mode-hook)

  ;; Custom pairs for programming modes
  (defun my/embrace-prog-mode-hook ()
    "Set up embrace for programming modes."
    (dolist (lst '((?$ "$" . "$")
                   (?` "`" . "`")
                   (?* "*" . "*")))
      (embrace-add-pair (car lst) (cadr lst) (cddr lst))))

  (add-hook 'prog-mode-hook #'my/embrace-prog-mode-hook))
