.emacs.d/config.org
*** Apheleia
#+begin_src emacs-lisp :tangle yes
(use-package apheleia
  :ensure t
  :hook (prog-mode . apheleia-mode)  ; Enable for all programming modes
  :bind (("C-c f f" . apheleia-format-buffer)
         ("C-c f r" . apheleia-format-region)
         ("C-c f t" . apheleia-toggle-mode))

  :custom
  ;; Formatting behavior
  (apheleia-log-only-errors t)           ; Only log errors, not successful runs
  (apheleia-hide-log-buffers t)          ; Hide log buffers automatically
  (apheleia-formatters-respect-indent-level t) ; Respect current indentation

  :config
  ;; Configure formatters for different languages

  ;; Python - use black + isort
  (setf (alist-get 'python-mode apheleia-mode-alist)
        '(isort black))
  (setf (alist-get 'python-ts-mode apheleia-mode-alist)
        '(isort black))

  ;; JavaScript/TypeScript - use prettier
  (setf (alist-get 'js-mode apheleia-mode-alist) 'prettier)
  (setf (alist-get 'js2-mode apheleia-mode-alist) 'prettier)
  (setf (alist-get 'typescript-mode apheleia-mode-alist) 'prettier)
  (setf (alist-get 'typescript-ts-mode apheleia-mode-alist) 'prettier)
  (setf (alist-get 'tsx-ts-mode apheleia-mode-alist) 'prettier)

  ;; Web development
  (setf (alist-get 'html-mode apheleia-mode-alist) 'prettier)
  (setf (alist-get 'css-mode apheleia-mode-alist) 'prettier)
  (setf (alist-get 'scss-mode apheleia-mode-alist) 'prettier)
  (setf (alist-get 'json-mode apheleia-mode-alist) 'prettier)
  (setf (alist-get 'web-mode apheleia-mode-alist) 'prettier)

  ;; Rust - use rustfmt
  (setf (alist-get 'rust-mode apheleia-mode-alist) 'rustfmt)
  (setf (alist-get 'rust-ts-mode apheleia-mode-alist) 'rustfmt)

  ;; Go - use gofmt + goimports
  (setf (alist-get 'go-mode apheleia-mode-alist) 'goimports)
  (setf (alist-get 'go-ts-mode apheleia-mode-alist) 'goimports)

  ;; C/C++ - use clang-format
  (setf (alist-get 'c-mode apheleia-mode-alist) 'clang-format)
  (setf (alist-get 'c++-mode apheleia-mode-alist) 'clang-format)
  (setf (alist-get 'c-ts-mode apheleia-mode-alist) 'clang-format)
  (setf (alist-get 'c++-ts-mode apheleia-mode-alist) 'clang-format)

  ;; Shell scripts
  (setf (alist-get 'sh-mode apheleia-mode-alist) 'shfmt)
  (setf (alist-get 'bash-ts-mode apheleia-mode-alist) 'shfmt)

  ;; YAML
  (setf (alist-get 'yaml-mode apheleia-mode-alist) 'prettier)
  (setf (alist-get 'yaml-ts-mode apheleia-mode-alist) 'prettier)

  ;; Markdown
  (setf (alist-get 'markdown-mode apheleia-mode-alist) 'prettier)

  ;; Add custom formatters
  (setf (alist-get 'goimports apheleia-formatters)
        '("goimports"))

  (setf (alist-get 'black apheleia-formatters)
        '("black" "--quiet" "-"))

  (setf (alist-get 'isort apheleia-formatters)
        '("isort" "--quiet" "--stdout" "-"))

  ;; Custom formatter for specific file types
  (defun my/setup-python-formatting ()
    "Configure Python formatting with black and isort."
    (when (derived-mode-p 'python-mode 'python-ts-mode)
      (setq-local apheleia-formatter '(isort black))))

  (add-hook 'python-mode-hook #'my/setup-python-formatting)
  (add-hook 'python-ts-mode-hook #'my/setup-python-formatting)

  ;; Disable formatting for certain file patterns
  (defun my/disable-apheleia-for-large-files ()
    "Disable apheleia for very large files."
    (when (> (buffer-size) 100000)  ; 100KB threshold
      (apheleia-mode -1)))

  (add-hook 'find-file-hook #'my/disable-apheleia-for-large-files)

  ;; Global formatting function
  (defun my/format-buffer-or-region ()
    "Format buffer or region if region is active."
    (interactive)
    (if (use-region-p)
        (apheleia-format-region (region-beginning) (region-end))
      (apheleia-format-buffer)))

  (global-set-key (kbd "C-M-\\") #'my/format-buffer-or-region))
#+end_src
** Window Management
*** Ace Window
#+begin_src emacs-lisp :tangle yes
(use-package ace-window
  :ensure t
  :bind (("M-o" . ace-window)
         ("C-x o" . ace-window))
  :custom
  (aw-keys '(?a ?s ?d ?f ?g ?h ?j ?k ?l))
  (aw-scope 'frame)
  (aw-background t)
  :config
  (ace-window-display-mode 1))
#+end_src

*** Popper - Popup Management
#+begin_src emacs-lisp :tangle yes
(use-package popper
  :ensure t
  :bind (("C-`" . popper-toggle-latest)
         ("M-`" . popper-cycle)
         ("C-M-`" . popper-toggle-type))
  :custom
  (popper-reference-buffers
   '("\\*Messages\\*"
     "Output\\*$"
     "\\*Async Shell Command\\*"
     "\\*Compile-Log\\*"
     "\\*Completions\\*"
     "\\*Warnings\\*"
     "\\*compilation\\*"
     "\\*Help\\*"
     "\\*helpful"
     help-mode
     compilation-mode
     flymake-diagnostics-buffer-mode))
  (popper-window-height 0.33)
  :init
  (popper-mode +1)
  (popper-echo-mode +1))
#+end_src

*** Perspective - Workspace Management
#+begin_src emacs-lisp :tangle yes
(use-package perspective
  :ensure t
  :bind (("C-x C-b" . persp-list-buffers)
         ("C-x b" . persp-switch-to-buffer*)
         ("C-x k" . persp-kill-buffer*))
  :custom
  (persp-mode-prefix-key (kbd "C-c C-p"))
  (persp-initial-frame-name "Main")
  (persp-suppress-no-prefix-key-warning t)
  :init
  (persp-mode)
  :config
  ;; Running `persp-mode' multiple times resets the perspective list...
  (unless (equal persp-mode t)
    (persp-mode)))
#+end_src

** Navigation
