.emacs.d/config.el
  :bind (;; Character-based jumping
         ("C-:" . avy-goto-char-timer)     ; Most used - type chars and jump
         ("C-'" . avy-goto-char-2)         ; Jump to 2 characters
         ("M-g c" . avy-goto-char)         ; Single character
         ("M-g f" . avy-goto-line)         ; Jump to line
         ("M-g w" . avy-goto-word-1)       ; Jump to word
         ("M-g e" . avy-goto-word-0)       ; Jump to word (any char)

         ;; Advanced navigation
         ("C-c j l" . avy-copy-line)       ; Copy line
         ("C-c j m" . avy-move-line)       ; Move line
         ("C-c j r" . avy-copy-region)     ; Copy region
         ("C-c j k" . avy-kill-whole-line) ; Kill line
         ("C-c j w" . avy-kill-region)     ; Kill region

         ;; Integration with other modes
         ("C-c j j" . avy-resume)          ; Resume last avy command
         )

  :custom
  ;; Appearance
  (avy-background t)                      ; Dim background during selection
  (avy-style 'at-full)                   ; Show hints at target locations
  (avy-keys '(?a ?s ?d ?f ?g ?h ?j ?k ?l)) ; Home row keys for hints

  ;; Behavior
  (avy-timeout-seconds 0.5)              ; Auto-jump after timeout
  (avy-all-windows nil)                  ; Only current window by default
  (avy-case-fold-search t)               ; Case insensitive
  (avy-word-punc-regexp "[!-/:-@\\[-`{-~]") ; Word punctuation

  ;; Visual customization
  (avy-lead-face-0 '((t (:foreground "white" :background "red"))))
  (avy-lead-face-1 '((t (:foreground "white" :background "blue"))))
  (avy-lead-face-2 '((t (:foreground "white" :background "green"))))

  :config
  ;; Custom avy actions
  (defun my/avy-action-kill-whole-line (pt)
    "Kill whole line at PT."
    (save-excursion
      (goto-char pt)
      (kill-whole-line))
    (select-window
     (cdr (ring-ref avy-ring 0))))

  (defun my/avy-action-copy-whole-line (pt)
    "Copy whole line at PT."
    (save-excursion
      (goto-char pt)
      (cl-destructuring-bind (start . end)
          (bounds-of-thing-at-point 'line)
        (copy-region-as-kill start end)))
    (select-window
     (cdr (ring-ref avy-ring 0))))

  (defun my/avy-action-teleport-whole-line (pt)
    "Move whole line at PT to current point."
    (avy-action-kill-whole-line pt)
    (save-excursion (yank))
    t)

  ;; Register custom actions
  (setq avy-dispatch-alist
        '((?x . avy-action-kill-move)
          (?X . avy-action-kill-stay)
          (?t . avy-action-teleport)
          (?m . avy-action-mark)
          (?c . avy-action-copy)
          (?y . avy-action-yank)
          (?Y . avy-action-yank-line)
          (?i . avy-action-ispell)
          (?z . avy-action-zap-to-char)
          (?k . my/avy-action-kill-whole-line)
          (?K . my/avy-action-copy-whole-line)
          (?T . my/avy-action-teleport-whole-line)))

  ;; Enhanced commands
  (defun my/avy-goto-char-timer-all-windows ()
    "Avy char timer across all windows."
    (interactive)
    (let ((avy-all-windows t))
      (avy-goto-char-timer)))

  (defun my/avy-goto-line-all-windows ()
    "Avy goto line across all windows."
    (interactive)
    (let ((avy-all-windows t))
      (avy-goto-line)))

  (global-set-key (kbd "C-M-:") #'my/avy-goto-char-timer-all-windows)
  (global-set-key (kbd "M-G") #'my/avy-goto-line-all-windows))

(use-package magit
  :ensure t
