.emacs.d/config.org
** Magit

The most powerful Git interface for Emacs, providing an intuitive and efficient way to interact with Git repositories. Magit transforms Git from a command-line tool into a visual, interactive experience.

*Project:* [[https://magit.vc/][Official Site]], [[https://github.com/magit/magit][GitHub - magit/magit]]
*Key Features:*
- Interactive staging and committing
- Visual branch and merge management
- Integrated blame, log, and diff viewing
- Stash management and cherry-picking
- Remote repository operations

*Essential Workflows:*
| Workflow | Key Binding | Command |
|----------|-------------|---------|
| Status Overview | C-x g | magit-status |
| Quick Commands | C-x M-g | magit-dispatch |
| File Operations | C-c g [s/u/l] | stage/unstage/log file |
| Repository Setup | C-c g [c/i] | clone/init repository |
| Blame & History | C-c g [b/l] | blame/log current file |

*Status Buffer Actions:*
- =s/u= - stage/unstage changes
- =c= - commit (with =c= for new commit)
- =P/F= - push/pull with remotes
- =b= - branch operations
- =m= - merge operations
- =r= - rebase operations

*Documentation:* =C-h f magit-status=, [[https://magit.vc/manual/][Magit Manual]]
#+begin_src emacs-lisp
(use-package magit
  :ensure t
  :bind (;; Global magit keybindings
         ("C-x g" . magit-status)           ; Main entry point
         ("C-c g g" . magit-status)         ; Quick access to magit status
         ("C-x M-g" . magit-dispatch)       ; Command dispatcher
         ("C-c g c" . magit-clone)          ; Clone repository
         ("C-c g i" . magit-init)           ; Initialize repository
         ("C-c g f" . magit-find-file)      ; Find file in git repo
         ("C-c g b" . magit-blame-addition) ; Blame current line
         ("C-c g l" . magit-log-buffer-file) ; Log for current file
         ("C-c g p" . magit-pull)           ; Quick pull
         ("C-c g P" . magit-push)           ; Quick push
         ("C-c g s" . magit-stage-file)     ; Stage current file
         ("C-c g u" . magit-unstage-file)   ; Unstage current file
         ;; Project-wide shortcuts
         ("C-x v d" . magit-diff)           ; Show diff
         ("C-x v l" . magit-log-all)        ; Show log
         ("C-x v s" . magit-status)         ; Alternative status binding
         )

  :custom
  ;; Performance and behavior
  (magit-auto-revert-mode t)                    ; Auto-revert buffers
  (magit-auto-revert-immediately t)             ; Revert immediately
  (magit-refresh-status-buffer t)               ; Auto-refresh status
  (magit-refresh-verbose nil)                   ; Reduce refresh noise
  (magit-diff-refine-hunk t)                    ; Show word-level diff
  (magit-diff-paint-whitespace t)               ; Highlight whitespace issues
  (magit-diff-highlight-trailing t)             ; Highlight trailing whitespace
  (magit-revision-show-gravatars t)             ; Show user avatars
  (magit-clone-always-transient t)              ; Use transient for clone
  (magit-save-repository-buffers 'dontask)     ; Save without asking
  (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1)

  ;; Commit behavior
  (magit-commit-show-diff t)                    ; Show diff when committing
  (magit-commit-extend-override-date t)         ; Extend commit date
  (magit-commit-ask-to-stage t)                 ; Ask to stage when committing

  ;; Log settings
  (magit-log-auto-more t)                       ; Automatically load more commits
  (magit-log-margin '(t "%Y-%m-%d %H:%M " magit-log-margin-width t 18)) ; Better log format

  ;; Push settings
  (magit-push-always-verify nil)                ; Don't verify push
  (magit-push-current-set-remote-if-missing t)  ; Set upstream automatically

  ;; Stash settings
  (magit-stash-clear-winconf t)                 ; Clear window config after stash

  :config
  ;; Enable magit-file-mode for better integration
  ;; (global-magit-file-mode t)

  ;; Configure section visibility
  (magit-add-section-hook 'magit-status-sections-hook
                          'magit-insert-modules
                          'magit-insert-stashes 'append)

  ;; Better commit message setup
  (setq git-commit-summary-max-length 50)
  (setq git-commit-fill-column 72)

  ;; Custom faces for better visibility
  (custom-set-faces
   '(magit-diff-added ((t (:background "#22aa22" :foreground "white"))))
   '(magit-diff-removed ((t (:background "#aa2222" :foreground "white"))))
   '(magit-diff-added-highlight ((t (:background "#33bb33" :foreground "white"))))
   '(magit-diff-removed-highlight ((t (:background "#bb3333" :foreground "white")))))

  ;; Magit status buffer customizations
  (magit-define-section-jumper magit-jump-to-staged "Staged changes" staged)
  (magit-define-section-jumper magit-jump-to-unstaged "Unstaged changes" unstaged)
  (magit-define-section-jumper magit-jump-to-untracked "Untracked files" untracked)
  (magit-define-section-jumper magit-jump-to-stashes "Stashes" stashes)

  ;; Enhanced keybindings within magit buffers
  :bind (:map magit-status-mode-map
              ("j" . magit-section-forward)
              ("k" . magit-section-backward)
              ("J" . magit-jump-to-unstaged)
              ("K" . magit-jump-to-staged)
              ("U" . magit-jump-to-untracked)
              ("S" . magit-jump-to-stashes)
              ("C-c C-a" . magit-commit-amend)
              ("C-c C-e" . magit-commit-extend)
              ("M-1" . magit-jump-to-unstaged)
              ("M-2" . magit-jump-to-staged)
              ("M-3" . magit-jump-to-untracked)
              ("M-4" . magit-jump-to-stashes))

  :bind (:map magit-diff-mode-map
              ("j" . magit-section-forward)
              ("k" . magit-section-backward)
              ("C-c C-d" . magit-diff-default-context)
              ("C-c C-e" . magit-diff-less-context)
              ("C-c C-f" . magit-diff-more-context))

  :bind (:map magit-log-mode-map
              ("j" . magit-section-forward)
              ("k" . magit-section-backward))

  :config
  ;; Magit popup/transient customizations
  (transient-append-suffix 'magit-fetch "p"
    '("a" "Fetch all" magit-fetch-all))

  (transient-append-suffix 'magit-pull "p"
    '("r" "Rebase" magit-pull-from-upstream)))
#+end_src

#+RESULTS:

*** git-commit
#+begin_src emacs-lisp
(use-package git-commit
  :ensure nil  ; Part of magit
  :after magit
  :hook (git-commit-mode . flyspell-mode)  ; Spell check commit messages
  :custom
  (git-commit-style-convention-checks '(non-empty-second-line
                                        overlong-summary-line))
  :config
  ;; Set up commit message template
  (setq git-commit-summary-max-length 50)
  (setq git-commit-fill-column 72))
#+end_src
*** magit-delta
#+begin_src emacs-lisp
(use-package magit-delta
  :ensure t
  :after magit
  :if (executable-find "delta")  ; Only if delta is installed
  :hook (magit-mode . magit-delta-mode)
  :custom
  (magit-delta-default-dark-theme "Monokai Extended")
  (magit-delta-default-light-theme "Github"))
#+end_src
*** diff-hl
#+begin_src emacs-lisp
(use-package diff-hl
  :ensure t
  :hook ((magit-pre-refresh . diff-hl-magit-pre-refresh)
         (magit-post-refresh . diff-hl-magit-post-refresh))
  :config
  (global-diff-hl-mode 1)
  (diff-hl-flydiff-mode 1)

  ;; Use margin instead of fringe in terminal
  (unless (display-graphic-p)
    (diff-hl-margin-mode 1)))
#+end_src
*** git-timemachine
#+begin_src emacs-lisp
(use-package git-timemachine
  :ensure t
  :bind (("C-c g t" . git-timemachine))
  :custom
  (git-timemachine-show-minibuffer-details t))
#+end_src
*** forge
#+begin_src emacs-lisp
(use-package forge
  :ensure t
  :after magit
  :custom
  (forge-topic-list-limit '(60 . 0))  ; Show more issues/PRs
  :config
  ;; Configure forge for your Git hosting service
  ;; GitHub Enterprise example:
  ;; (push '("git.company.com" "git.company.com/api/v3"
  ;;         "git.company.com" forge-github-repository)
  ;;       forge-alist)
  )
#+end_src
*** magit-todos
#+begin_src emacs-lisp
(use-package magit-todos
  :ensure t
  :after magit
  :config
  ;; Enable globally as intended by the author
  (magit-todos-mode 1))
#+end_src
*** Git Modes (gitconfig, gitignore, etc.)
#+begin_src emacs-lisp
(use-package git-modes
  :ensure t
  ;; gitconfig-mode and gitignore-mode are included automatically
  )
#+end_src
*** magit-file-icons (disabled - package unavailable)
#+begin_src emacs-lisp
;; (use-package magit-file-icons
;;   :ensure t
;;   :after magit
;;   :config
;;   (magit-file-icons-mode 1))
#+end_src
