.emacs.d/config.el
  :bind (;; Global magit keybindings
         ("C-x g" . magit-status)           ; Main entry point
         ("C-c g g" . magit-status)         ; Quick access to magit status
         ("C-x M-g" . magit-dispatch)       ; Command dispatcher
         ("C-c g c" . magit-clone)          ; Clone repository
         ("C-c g i" . magit-init)           ; Initialize repository
         ("C-c g f" . magit-find-file)      ; Find file in git repo
         ("C-c g b" . magit-blame-addition) ; Blame current line
         ("C-c g l" . magit-log-buffer-file) ; Log for current file
         ("C-c g p" . magit-pull)           ; Quick pull
         ("C-c g P" . magit-push)           ; Quick push
         ("C-c g s" . magit-stage-file)     ; Stage current file
         ("C-c g u" . magit-unstage-file)   ; Unstage current file
         ;; Project-wide shortcuts
         ("C-x v d" . magit-diff)           ; Show diff
         ("C-x v l" . magit-log-all)        ; Show log
         ("C-x v s" . magit-status)         ; Alternative status binding
         )

  :custom
  ;; Performance and behavior
  (magit-auto-revert-mode t)                    ; Auto-revert buffers
  (magit-auto-revert-immediately t)             ; Revert immediately
  (magit-refresh-status-buffer t)               ; Auto-refresh status
  (magit-refresh-verbose nil)                   ; Reduce refresh noise
  (magit-diff-refine-hunk t)                    ; Show word-level diff
  (magit-diff-paint-whitespace t)               ; Highlight whitespace issues
  (magit-diff-highlight-trailing t)             ; Highlight trailing whitespace
  (magit-revision-show-gravatars t)             ; Show user avatars
  (magit-clone-always-transient t)              ; Use transient for clone
  (magit-save-repository-buffers 'dontask)     ; Save without asking
  (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1)

  ;; Commit behavior
  (magit-commit-show-diff t)                    ; Show diff when committing
  (magit-commit-extend-override-date t)         ; Extend commit date
  (magit-commit-ask-to-stage t)                 ; Ask to stage when committing

  ;; Log settings
  (magit-log-auto-more t)                       ; Automatically load more commits
  (magit-log-margin '(t "%Y-%m-%d %H:%M " magit-log-margin-width t 18)) ; Better log format

  ;; Push settings
  (magit-push-always-verify nil)                ; Don't verify push
  (magit-push-current-set-remote-if-missing t)  ; Set upstream automatically

  ;; Stash settings
  (magit-stash-clear-winconf t)                 ; Clear window config after stash

  :config
  ;; Enable magit-file-mode for better integration
  (global-magit-file-mode t)

  ;; Configure section visibility
  (magit-add-section-hook 'magit-status-sections-hook
                          'magit-insert-modules
                          'magit-insert-stashes 'append)

  ;; Better commit message setup
  (setq git-commit-summary-max-length 50)
  (setq git-commit-fill-column 72)

  ;; Custom faces for better visibility
  (custom-set-faces
   '(magit-diff-added ((t (:background "#22aa22" :foreground "white"))))
   '(magit-diff-removed ((t (:background "#aa2222" :foreground "white"))))
   '(magit-diff-added-highlight ((t (:background "#33bb33" :foreground "white"))))
   '(magit-diff-removed-highlight ((t (:background "#bb3333" :foreground "white")))))

  ;; Magit status buffer customizations
  (magit-define-section-jumper magit-jump-to-staged "Staged changes" staged)
  (magit-define-section-jumper magit-jump-to-unstaged "Unstaged changes" unstaged)
  (magit-define-section-jumper magit-jump-to-untracked "Untracked files" untracked)
  (magit-define-section-jumper magit-jump-to-stashes "Stashes" stashes)

  ;; Enhanced keybindings within magit buffers
  :bind (:map magit-status-mode-map
              ("j" . magit-section-forward)
              ("k" . magit-section-backward)
              ("J" . magit-jump-to-unstaged)
              ("K" . magit-jump-to-staged)
              ("U" . magit-jump-to-untracked)
              ("S" . magit-jump-to-stashes)
              ("C-c C-a" . magit-commit-amend)
              ("C-c C-e" . magit-commit-extend)
              ("M-1" . magit-jump-to-unstaged)
              ("M-2" . magit-jump-to-staged)
              ("M-3" . magit-jump-to-untracked)
              ("M-4" . magit-jump-to-stashes))

  :bind (:map magit-diff-mode-map
              ("j" . magit-section-forward)
              ("k" . magit-section-backward)
              ("C-c C-d" . magit-diff-default-context)
              ("C-c C-e" . magit-diff-less-context)
              ("C-c C-f" . magit-diff-more-context))

  :bind (:map magit-log-mode-map
              ("j" . magit-section-forward)
              ("k" . magit-section-backward))

  :config
  ;; Magit popup/transient customizations
  (transient-append-suffix 'magit-fetch "p"
    '("a" "Fetch all" magit-fetch-all))

  (transient-append-suffix 'magit-pull "p"
    '("r" "Rebase" magit-pull-from-upstream)))

(use-package git-commit
  :ensure nil  ; Part of magit
  :after magit
  :hook (git-commit-mode . flyspell-mode)  ; Spell check commit messages
  :custom
  (git-commit-style-convention-checks '(non-empty-second-line
                                        overlong-summary-line))
  :config
  ;; Set up commit message template
  (setq git-commit-summary-max-length 50)
  (setq git-commit-fill-column 72))

(use-package magit-delta
  :ensure t
  :after magit
  :if (executable-find "delta")  ; Only if delta is installed
  :hook (magit-mode . magit-delta-mode)
  :custom
  (magit-delta-default-dark-theme "Monokai Extended")
  (magit-delta-default-light-theme "Github"))

(use-package diff-hl
  :ensure t
  :hook ((magit-pre-refresh . diff-hl-magit-pre-refresh)
         (magit-post-refresh . diff-hl-magit-post-refresh))
  :config
  (global-diff-hl-mode 1)
  (diff-hl-flydiff-mode 1)

  ;; Use margin instead of fringe in terminal
  (unless (display-graphic-p)
    (diff-hl-margin-mode 1)))

(use-package git-timemachine
  :ensure t
  :bind (("C-c g t" . git-timemachine))
  :custom
  (git-timemachine-show-minibuffer-details t))

(use-package forge
  :ensure t
  :after magit
  :custom
  (forge-topic-list-limit '(60 . 0))  ; Show more issues/PRs
  :config
  ;; Configure forge for your Git hosting service
  ;; GitHub Enterprise example:
  ;; (push '("git.company.com" "git.company.com/api/v3"
  ;;         "git.company.com" forge-github-repository)
  ;;       forge-alist)
  )

(use-package magit-todos
  :ensure t
  :after magit
  :config
  (magit-todos-mode 1)
  :custom
  (magit-todos-ignore-file-suffixes '(".map" ".min.js" ".min.css"))
  (magit-todos-exclude-globs '("node_modules" "*.log" "*.tmp")))

(use-package git-modes
  :ensure t
  ;; gitconfig-mode and gitignore-mode are included automatically
  )

;; (use-package magit-file-icons
;;   :ensure t
;;   :after magit
;;   :config
;;   (magit-file-icons-mode 1))
