.emacs.d/config.el

;; Advanced magit workflows
(defun my/magit-kill-file-on-line ()
  "Kill file on current line in magit-status buffer."
  (interactive)
  (when-let* ((file (magit-file-at-point)))
    (when (yes-or-no-p (format "Delete file %s? " file))
      (delete-file file)
      (magit-refresh))))

(defun my/magit-stage-all-and-commit ()
  "Stage all changes and commit."
  (interactive)
  (magit-stage-modified)
  (magit-commit-create))

(defun my/magit-quick-commit ()
  "Quick commit with message prompt."
  (interactive)
  (let ((message (read-string "Commit message: ")))
    (when (> (length message) 0)
      (magit-stage-modified)
      (magit-commit-create (list "-m" message)))))

(defun my/magit-push-current ()
  "Push current branch to origin."
  (interactive)
  (magit-push-current-to-upstream nil))

(defun my/magit-pull-rebase ()
  "Pull with rebase."
  (interactive)
  (magit-pull-from-upstream '("--rebase")))

(defun my/magit-browse-remote ()
  "Browse remote repository in browser."
  (interactive)
  (browse-url (magit-get "remote.origin.url")))

;; Additional useful keybindings
(with-eval-after-load 'magit
  (define-key magit-status-mode-map (kbd "C-c C-q") #'my/magit-quick-commit)
  (define-key magit-status-mode-map (kbd "C-c C-p") #'my/magit-push-current)
  (define-key magit-status-mode-map (kbd "C-c C-r") #'my/magit-pull-rebase)
  (define-key magit-status-mode-map (kbd "C-c C-b") #'my/magit-browse-remote)
  (define-key magit-status-mode-map (kbd "D") #'my/magit-kill-file-on-line))

(setq magit-refresh-status-buffer nil)
(setq auto-revert-buffer-list-filter 'magit-auto-revert-repository-buffer-p)

(setq magit-repository-directories
      '(("~/dev" . 2)
        ("~/.config" . 0)))

(global-set-key (kbd "C-c g r") 'magit-list-repositories)

(setq magit-buffer-name-format "*%M%v: %t%x*")

(setq magit-ediff-dwim-show-on-hunks t)

(add-hook 'magit-diff-visit-file-hook 'magit-diff-show-or-scroll-up)

(add-hook 'magit-pre-refresh-hook 'magit-maybe-save-repository-buffers)

(use-package org
  :ensure nil  ; Built-in
  :mode ("\\.org\\'" . org-mode)
  :bind (("C-c a" . org-agenda)
         ("C-c x" . org-capture)
         ("C-c l" . org-store-link)
         ("C-c C-l" . org-insert-link)
         ("C-c o" . hydra-org/body))  ; Transient menu

  :custom
  ;; General settings
  (org-directory "~/org/")
  (org-default-notes-file (concat org-directory "notes.org"))
  (org-agenda-files (list org-directory))
  (org-return-follows-link t)
  (org-mouse-1-follows-link t)
  (org-startup-folded 'content)
  (org-startup-indented t)
  (org-startup-with-inline-images t)

  ;; Editing behavior
  (org-edit-src-content-indentation 0)
  (org-src-tab-acts-natively t)
  (org-src-preserve-indentation t)
  (org-src-fontify-natively t)
  (org-confirm-babel-evaluate nil)
  (org-hide-emphasis-markers t)
  (org-pretty-entities t)
  (org-ellipsis " ▼")

  ;; TODO keywords
  (org-todo-keywords
   '((sequence "TODO(t)" "NEXT(n)" "DOING(d)" "|" "DONE(D)" "CANCELLED(c)")
     (sequence "IDEA(i)" "SOMEDAY(s)" "|" "ABANDONED(a)")))

  (org-todo-keyword-faces
   '(("TODO" . (:foreground "#ff6c6b" :weight bold))
     ("NEXT" . (:foreground "#ECBE7B" :weight bold))
     ("DOING" . (:foreground "#1B8F9B" :weight bold))
     ("DONE" . (:foreground "#98be65" :weight bold))
     ("CANCELLED" . (:foreground "#5B6268" :weight bold))
     ("IDEA" . (:foreground "#c678dd" :weight bold))
     ("SOMEDAY" . (:foreground "#a9a1e1" :weight bold))))

  ;; Priority settings
  (org-priority-highest ?A)
  (org-priority-default ?B)
  (org-priority-lowest ?C)
  (org-priority-faces
   '((?A . (:foreground "#ff6c6b" :weight bold))
     (?B . (:foreground "#ECBE7B"))
     (?C . (:foreground "#5B6268"))))

  ;; Tags
  (org-tag-alist
   '(("@work" . ?w)
     ("@home" . ?h)
     ("@computer" . ?c)
     ("@phone" . ?p)
     ("@errands" . ?e)
     ("project" . ?P)
     ("idea" . ?i)
     ("someday" . ?s)))

  ;; Archive
  (org-archive-location "~/org/archive.org::* From %s")

  :config
  ;; Enable org-indent-mode by default
  (add-hook 'org-mode-hook #'org-indent-mode)

  ;; Better source block editing
  (add-hook 'org-mode-hook
            (lambda ()
              ;; Only set electric-pair-inhibit-predicate if it exists (Emacs 24.4+)
              (when (boundp 'electric-pair-inhibit-predicate)
                (setq-local electric-pair-inhibit-predicate
                            `(lambda (c)
                               (if (char-equal c ?<) t (,electric-pair-inhibit-predicate c))))))))

(use-package org-agenda
  :ensure nil  ; Built-in
  :after org
  :bind (:map org-agenda-mode-map
              ("j" . org-agenda-next-line)
              ("k" . org-agenda-previous-line)
              ("C-c C-o" . org-agenda-open-link))

  :custom
  ;; Agenda view settings
  (org-agenda-window-setup 'current-window)
  (org-agenda-restore-windows-after-quit t)
  (org-agenda-start-with-log-mode t)
  (org-agenda-include-diary t)
  (org-agenda-start-on-weekday nil)
  (org-agenda-span 7)
  (org-agenda-start-day "-1d")

  ;; Agenda appearance
  (org-agenda-current-time-string "◀── now")
  (org-agenda-time-grid
   '((daily today require-timed)
     (800 1000 1200 1400 1600 1800 2000)
     "......" "────────────────"))

  ;; Custom agenda commands
  (org-agenda-custom-commands
   '(("d" "Daily agenda and all TODOs"
      ((agenda "" ((org-agenda-span 1)))
       (alltodo "")))
     ("w" "Weekly agenda"
      ((agenda "" ((org-agenda-span 7)))))
     ("n" "Next actions"
      ((todo "NEXT")))
     ("p" "Projects"
      ((tags-todo "project")))
     ("i" "Ideas and someday"
      ((todo "IDEA")
       (todo "SOMEDAY"))))))

(use-package org-capture
  :ensure nil  ; Built-in
  :after org
  :custom
  (org-capture-templates
   '(("t" "Todo" entry (file+headline "~/org/tasks.org" "Inbox")
      "* TODO %?\n  SCHEDULED: %t\n  :PROPERTIES:\n  :CREATED: %U\n  :END:\n")

     ("n" "Note" entry (file "~/org/notes.org")
      "* %?\n  :PROPERTIES:\n  :CREATED: %U\n  :END:\n")

     ("i" "Idea" entry (file+headline "~/org/ideas.org" "Ideas")
      "* IDEA %?\n  :PROPERTIES:\n  :CREATED: %U\n  :END:\n")

     ("m" "Meeting" entry (file+headline "~/org/meetings.org" "Meetings")
      "* %?\n  :PROPERTIES:\n  :CREATED: %U\n  :END:\n")

     ("j" "Journal" entry (file+datetree "~/org/journal.org")
      "* %U %?\n")

     ("l" "Link" entry (file "~/org/links.org")
      "* %?\n  %a\n  :PROPERTIES:\n  :CREATED: %U\n  :END:\n")

     ("p" "Project" entry (file+headline "~/org/projects.org" "Projects")
      "* TODO %? :project:\n  SCHEDULED: %t\n  :PROPERTIES:\n  :CREATED: %U\n  :END:\n"))))

(use-package ob
  :ensure nil  ; Built-in
  :after org
  :custom
