.emacs.d/config.org
** Org Babel
#+begin_src emacs-lisp
(use-package ob
  :ensure nil  ; Built-in
  :after org
  :custom
  (org-babel-load-languages
   '((emacs-lisp . t)
     (python . t)
     (shell . t)
     (js . t)
     (sql . t)
     (org . t)
     (makefile . t)
     (plantuml . t)))

  :config
  ;; Don't prompt before running code in org
  (setq org-confirm-babel-evaluate nil)

  ;; Display images inline after executing
  (add-hook 'org-babel-after-execute-hook 'org-redisplay-inline-images)

  ;; Better source block templates
  (add-to-list 'org-structure-template-alist '("py" . "src python"))
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
  (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
  (add-to-list 'org-structure-template-alist '("js" . "src js")))
#+end_src

** Org Export Base
#+begin_src emacs-lisp
(use-package ox
  :ensure nil  ; Built-in
  :after org
  :custom
  ;; Export settings
  (org-export-with-smart-quotes t)
  (org-export-with-section-numbers nil)
  (org-export-with-toc t)
  (org-export-headline-levels 4)
  (org-export-with-drawers nil)
  (org-export-with-timestamps nil)
  (org-export-preserve-breaks nil)
  (org-export-with-sub-superscripts '{})

  ;; HTML export
  (org-html-validation-link nil)
  (org-html-head-include-scripts nil)
  (org-html-head-include-default-style nil)
  (org-html-head "<link rel=\"stylesheet\" href=\"https://cdn.simplecss.org/simple.min.css\" />")

  :config
  ;; Custom export backends
  (require 'ox-html)
  (require 'ox-latex)
  (require 'ox-md)
  (require 'ox-ascii))
#+end_src

** Org Roam
#+begin_src emacs-lisp
(use-package org-roam
  :ensure t
  :after org
  :bind (("C-c n f" . org-roam-node-find)
         ("C-c n r" . org-roam-node-random)
         ("C-c n i" . org-roam-node-insert)
         ("C-c n c" . org-roam-capture)
         ("C-c n j" . org-roam-dailies-capture-today)
         ("C-c n t" . org-roam-dailies-goto-today)
         ("C-c n y" . org-roam-dailies-goto-yesterday)
         ("C-c n d" . org-roam-dailies-goto-date)
         ("C-c n g" . org-roam-graph)
         ("C-c n u" . org-roam-ui-mode))

  :custom
  (org-roam-directory "~/org/roam/")
  (org-roam-complete-everywhere t)
  (org-roam-completion-system 'default)

  ;; Daily notes
  (org-roam-dailies-directory "daily/")
  (org-roam-dailies-capture-templates
   '(("d" "default" entry "* %<%H:%M> %?"
      :target (file+head "%<%Y-%m-%d>.org" "#+title: %<%Y-%m-%d>\n"))))

  ;; Capture templates
  (org-roam-capture-templates
   '(("d" "default" plain "%?"
      :target (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+date: %U\n")
      :unnarrowed t)
     ("r" "reference" plain "%?"
      :target (file+head "reference/%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+date: %U\n#+filetags: :reference:\n")
      :unnarrowed t)
     ("p" "project" plain "%?"
      :target (file+head "project/%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+date: %U\n#+filetags: :project:\n")
      :unnarrowed t)))

  :config
  (org-roam-db-autosync-mode)

  ;; Create org-roam directory if it doesn't exist
  (unless (file-directory-p org-roam-directory)
    (make-directory org-roam-directory t)))
#+end_src

** Enhanced UI - Org Modern
#+begin_src emacs-lisp
(use-package org-modern
  :ensure t
  :after org
  :hook ((org-mode . org-modern-mode)
         (org-agenda-finalize . org-modern-agenda))

  :custom
  ;; Modern styling
  (org-modern-keyword nil)
  (org-modern-checkbox nil)
  (org-modern-table nil)
  (org-modern-tag t)
  (org-modern-priority t)
  (org-modern-todo t)
  (org-modern-timestamp t)
  (org-modern-statistics t)
  (org-modern-progress t)

  ;; Styling options
  (org-modern-star '("●" "○" "✸" "✿" "◆" "◇"))
  (org-modern-list '((?+ . "➤") (?- . "–") (?* . "•")))
  (org-modern-tag-faces
   '(("work" . (:background "#1e90ff" :foreground "white" :weight bold))
     ("home" . (:background "#32cd32" :foreground "white" :weight bold))
     ("project" . (:background "#ff6347" :foreground "white" :weight bold)))))
#+end_src

** Enhanced UI - Org Superstar
#+begin_src emacs-lisp
(use-package org-superstar
  :ensure t
  :after org
  :hook (org-mode . org-superstar-mode)
  :custom
  ;; Headline bullets
  (org-superstar-headline-bullets-list '("●" "○" "✸" "✿" "◆" "◇" "▪" "▫"))
  (org-superstar-cycle-headline-bullets t)
  (org-superstar-leading-bullet " ")

  ;; TODO keyword bullets
  (org-superstar-todo-bullet-alist
   '(("TODO" . ?☐)
     ("NEXT" . ?⚡)
     ("DOING" . ?⚙)
     ("DONE" . ?☑)
     ("CANCELLED" . ?☒)
     ("IDEA" . ?💡)
     ("SOMEDAY" . ?📅)))

  ;; Priority indicators
  (org-superstar-priority-bullet-alist
   '((?A . ?🔴)
     (?B . ?🟡)
     (?C . ?🟢)))

  ;; Appearance settings
  (org-superstar-remove-leading-stars t)
  (org-superstar-special-todo-items t)
  (org-superstar-configure-like-org-bullets t)

  :config
  ;; Make sure we hide the leading stars properly
  (setq org-hide-leading-stars nil)
  (setq org-superstar-leading-fallback ?\s))
#+end_src

** Enhanced UI - Org Appear
#+begin_src emacs-lisp
(use-package org-appear
  :ensure t
  :after org
  :hook (org-mode . org-appear-mode)
  :custom
  (org-appear-autolinks t)
  (org-appear-autosubmarkers t)
  (org-appear-autoentities t)
  (org-appear-autokeywords t)
  (org-appear-inside-latex t))
#+end_src

** Table of Contents - TOC Org
#+begin_src emacs-lisp
(use-package toc-org
  :ensure t
  :after org
  :hook (org-mode . toc-org-mode)
  :bind (("C-c C-o" . toc-org-insert-toc)
         ("C-c C-u" . toc-org-update))

  :custom
  ;; TOC settings
  (toc-org-max-depth 3)
  (toc-org-hrefify-default "gh")  ; GitHub-style links by default
  (toc-org-enable-links-opening t)

  :config
  ;; Auto-update TOC on save
  (add-hook 'org-mode-hook
            (lambda ()
              (add-hook 'before-save-hook #'toc-org-insert-toc nil 'local)))

  ;; Custom TOC functions
  (defun my/toc-org-insert-drawer-toc ()
    "Insert TOC in a drawer."
    (interactive)
    (let ((toc-org-enable-links-opening nil))
      (save-excursion
        (goto-char (point-min))
        (when (re-search-forward "^\\*\\*? " nil t)
          (beginning-of-line)
          (insert ":TOC:\n")
          (toc-org-insert-toc)
          (insert ":END:\n\n")))))

  (defun my/toc-org-export-options ()
    "Set export options for better TOC generation."
    (interactive)
    (save-excursion
      (goto-char (point-min))
      (unless (re-search-forward "^#\\+OPTIONS:" nil t)
        (insert "#+OPTIONS: toc:3 num:nil\n")
        (insert "#+TOC: headlines 3\n\n"))))

  ;; Different TOC styles
  (defun my/toc-org-github-style ()
    "Set GitHub-style TOC."
    (interactive)
    (setq-local toc-org-hrefify-default "gh"))

  (defun my/toc-org-org-style ()
    "Set Org-style TOC."
    (interactive)
    (setq-local toc-org-hrefify-default "org"))

  ;; Bind additional functions
  (define-key org-mode-map (kbd "C-c t i") #'my/toc-org-insert-drawer-toc)
  (define-key org-mode-map (kbd "C-c t e") #'my/toc-org-export-options)
  (define-key org-mode-map (kbd "C-c t g") #'my/toc-org-github-style)
  (define-key org-mode-map (kbd "C-c t o") #'my/toc-org-org-style))
#+end_src

** Robust Export Options - Pandoc
#+begin_src emacs-lisp
(use-package ox-pandoc
  :ensure t
  :after ox
  :custom
  ;; Pandoc options
  (org-pandoc-options-for-docx '((standalone . t)))
  (org-pandoc-options-for-latex-pdf '((pdf-engine . "xelatex")))
  (org-pandoc-options-for-beamer-pdf '((pdf-engine . "xelatex")))

  :config
  ;; Enable additional export formats
  (setq org-pandoc-menu-entry
        '((?d "docx" org-pandoc-export-to-docx)
          (?p "pdf" org-pandoc-export-to-latex-pdf)
          (?b "beamer-pdf" org-pandoc-export-to-beamer-pdf)
          (?e "epub" org-pandoc-export-to-epub)
          (?w "mediawiki" org-pandoc-export-to-mediawiki)
          (?r "rst" org-pandoc-export-to-rst)
          (?j "json" org-pandoc-export-to-json)
          (?y "yaml" org-pandoc-export-to-yaml))))
#+end_src

