.emacs.d/config.el

(use-package ox-hugo
  :ensure t
  :after ox
  :custom
  ;; Hugo export settings
  (org-hugo-base-dir "~/blog/")  ; Adjust to your Hugo site directory
  (org-hugo-section "posts")
  (org-hugo-auto-set-lastmod t)
  (org-hugo-suppress-lastmod-period 86400)  ; 24 hours
  (org-hugo-date-format "%Y-%m-%d")
  (org-hugo-front-matter-format "yaml")

  :config
  ;; Hugo capture template (add this to org-capture-templates)
  (with-eval-after-load 'org-capture
    (add-to-list 'org-capture-templates
                 '("h" "Hugo post" entry
                   (file+olp "~/org/hugo-posts.org" "Blog Ideas")
                   "* TODO %?\n:PROPERTIES:\n:EXPORT_FILE_NAME: %^{File name}\n:EXPORT_DATE: %U\n:END:\n"))))

(use-package ox-reveal
  :ensure t
  :after ox
  :custom
  (org-reveal-root "https://cdn.jsdelivr.net/npm/reveal.js")
  (org-reveal-mathjax t))

(use-package ox-twbs
  :ensure t
  :after ox)

;; Export to GitHub Flavored Markdown
(use-package ox-gfm
  :ensure t
  :after ox)

;; Export to Confluence Wiki format
;; ox-confluence package is unavailable
;; (use-package ox-confluence
;;   :ensure t
;;   :after ox)

;; Export to Slack format
(use-package ox-slack
  :ensure t
  :after ox)

(defhydra hydra-org (:color blue :hint nil)
  "
^Navigate^        ^Edit^              ^Insert^         ^Export^           ^Query^
────────────────────────────────────────────────────────────────────────────────────
_j_: next         _t_: todo           _l_: link        _e_: export menu   _q q_: search
_k_: prev         _s_: schedule       _T_: table       h: hugo export   _q v_: view
_u_: up           D: deadline       _b_: babel       _p_: pandoc pdf    _q t_: today
_g_: goto         _r_: refile         _i_: image       _m_: markdown      _q n_: next
_f_: find         _A_: archive        w: drawer      _H_: html          _q p_: projects
_/_: search       _P_: priority       _p_: property    _L_: latex         _q_: quit

^Capture^         ^Download^          ^Cliplink^       ^TOC^
────────────────────────────────────────────────────────────────────────────────────
_c_: capture      _d y_: yank         _L_: cliplink    C-o: insert toc
_a_: agenda       _d s_: screenshot   C-L: metadata    C-u: update toc
_n_: notes        _d f_: file         ^                _t i_: toc drawer
_R_: roam         _d r_: rename       ^                _t g_: github style

^Super Agenda^
────────────────────────────────────────────────────────────────────────────────────
_S a_: super agenda mode    _S z_: super view
"
  ;; Navigation
  ("j" org-next-visible-heading)
  ("k" org-previous-visible-heading)
  ("u" outline-up-heading)
  ("g" org-goto)
  ("f" org-find-olp)
  ("/" org-sparse-tree)

  ;; Editing
  ("t" org-todo)
  ("s" org-schedule)
  ("D" org-deadline)
  ("r" org-refile)
  ("A" org-archive-subtree)
  ("P" org-priority)

  ;; Insert
  ("l" org-insert-link)
  ("T" org-table-create-or-convert-from-region)
  ("b" org-insert-structure-template)
  ("i" org-download-yank)
  ("w" org-insert-drawer)
  ("p" org-set-property)

  ;; Export
  ("e" org-export-dispatch)
  ("h" org-hugo-export-wim-to-md)
  ("p" org-pandoc-export-to-latex-pdf)
  ("m" org-md-export-to-markdown)
  ("H" org-html-export-to-html)
  ("L" org-latex-export-to-pdf)

  ;; Query/Search (org-ql)
  ("q q" org-ql-search)
  ("q v" org-ql-view)
  ("q t" my/org-ql-today-tasks)
  ("q n" my/org-ql-next-actions)
  ("q p" my/org-ql-projects)

  ;; Download
  ("d y" org-download-yank)
  ("d s" org-download-screenshot)
  ("d f" org-download-image)
  ("d r" org-download-rename-at-point)

  ;; Cliplink
  ("L" org-cliplink)
  ("C-L" my/org-cliplink-with-metadata)

  ;; Super Agenda
  ("S a" org-super-agenda-mode)
  ("S z" (org-agenda nil "z"))

  ;; TOC
  ("C-o" toc-org-insert-toc)
  ("C-u" toc-org-update)
  ("t i" my/toc-org-insert-drawer-toc)
  ("t g" my/toc-org-github-style)

  ;; Capture & Quick Access
  ("c" org-capture)
  ("a" org-agenda)
  ("n" (find-file org-default-notes-file))
  ("R" org-roam-node-find)

  ("q" nil))

;; Bind to C-c o
(global-set-key (kbd "C-c o") 'hydra-org/body)

(defhydra hydra-org-roam (:color blue :hint nil)
  "
^Nodes^           ^Dailies^         ^Database^        ^Graph^
────────────────────────────────────────────────────────────
_f_: find         _t_: today        _s_: sync         _g_: graph
_i_: insert       _y_: yesterday    _b_: build        _u_: ui
_c_: capture      _d_: goto date    _c_: clear        _q_: quit
_r_: random       _j_: journal
_a_: alias        _T_: tomorrow
"
  ;; Nodes
  ("f" org-roam-node-find)
  ("i" org-roam-node-insert)
  ("c" org-roam-capture)
  ("r" org-roam-node-random)
  ("a" org-roam-alias-add)

  ;; Dailies
  ("t" org-roam-dailies-goto-today)
  ("y" org-roam-dailies-goto-yesterday)
  ("d" org-roam-dailies-goto-date)
  ("j" org-roam-dailies-capture-today)
  ("T" org-roam-dailies-goto-tomorrow)

  ;; Database
  ("s" org-roam-db-sync)
  ("b" org-roam-db-build-cache)
  ("c" org-roam-db-clear-all)

  ;; Graph
  ("g" org-roam-graph)
  ("u" org-roam-ui-mode)

  ("q" nil))

;; Bind to C-c n
(global-set-key (kbd "C-c n") 'hydra-org-roam/body)
