.emacs.d/config.el

;; Master cheatsheet menu
(defhydra hydra-cheatsheet (:color blue :hint nil)
  "
^Movement^    ^Editing^     ^Windows^     ^Buffers^     ^Search^      ^Help^
──────────────────────────────────────────────────────────────────────────
_m_: movement  _e_: editing   _w_: windows   _b_: buffers   _s_: search    h: help
_q_: quit      _r_: regions   _f_: frames    _d_: dired     _n_: navigate  _a_: ansible
^              ^              ^              ^              ^              _?_: describe
"
  ("m" hydra-movement/body "Movement")
  ("e" hydra-editing/body "Editing")
  ("r" hydra-regions/body "Regions")
  ("w" hydra-windows/body "Windows")
  ("f" hydra-frames/body "Frames")
  ("b" hydra-buffers/body "Buffers")
  ("d" hydra-dired/body "Dired")
  ("s" hydra-search/body "Search")
  ("n" hydra-navigation/body "Navigate")
  ("a" hydra-ansible/body "Ansible")
  ("h" hydra-help/body "Help")
  ("?" describe-key "Describe key")
  ("q" nil "Quit"))

;; Movement hydra
(defhydra hydra-movement (:color red :hint nil)
  "
^Character^   ^Word^        ^Line^           ^Paragraph^   ^Page^        ^Buffer^
───────────────────────────────────────────────────────────────────────────────
h: ←        M-b: ← word   C-a: line start  M-{: ← para   C-v: pg down   M-<: start
_l_: →        M-f: → word   C-e: line end    M-}: → para   M-v: pg up     M->: end
_j_: ↓        ^             C-n: next line   ^             ^              M-m: indent
_k_: ↑        ^             C-p: prev line   ^             ^              ^
^             ^             M-g g: goto line  ^             ^             _q_: quit
"
  ;; Character movement
  ("h" backward-char)
  ("l" forward-char)
  ("j" next-line)
  ("k" previous-line)

  ;; Word movement
  ("M-b" backward-word)
  ("M-f" forward-word)

  ;; Line movement
  ("C-a" beginning-of-line)
  ("C-e" end-of-line)
  ("C-n" next-line)
  ("C-p" previous-line)
  ("M-g g" goto-line :color blue)

  ;; Paragraph movement
  ("M-{" backward-paragraph)
  ("M-}" forward-paragraph)

  ;; Page movement
  ("C-v" scroll-up-command)
  ("M-v" scroll-down-command)

  ;; Buffer movement
  ("M-<" beginning-of-buffer)
  ("M->" end-of-buffer)
  ("M-m" back-to-indentation)

  ("q" nil "quit"))

;; Editing hydra
(defhydra hydra-editing (:color red :hint nil)
  "
^Basic Edit^     ^Kill/Yank^      ^Transform^     ^Undo/Redo^    ^Special^
─────────────────────────────────────────────────────────────────────────
_d_: del char    C-k: kill line   M-u: upper       C-/: undo      C-x C-o: del blank
_DEL_: del ←     M-d: kill word    M-l: lower       C-g C-/: redo  M-^: join lines
C-d: del →       C-y: yank         M-c: capital     ^              C-t: transpose
_RET_: newline   M-y: yank pop     C-x C-u: up      ^              M-t: trans word
_TAB_: indent    C-w: kill reg     C-x C-l: down    ^              _q_: quit
"
  ;; Basic editing
  ("d" delete-char)
  ("DEL" delete-backward-char)
  ("C-d" delete-char)
  ("RET" newline-and-indent)
  ("TAB" indent-for-tab-command)

  ;; Kill and yank
  ("C-k" kill-line)
  ("M-d" kill-word)
  ("C-y" yank)
  ("M-y" yank-pop)
  ("C-w" kill-region)

  ;; Transform text
  ("M-u" upcase-word)
  ("M-l" downcase-word)
  ("M-c" capitalize-word)
  ("C-x C-u" upcase-region :color blue)
  ("C-x C-l" downcase-region :color blue)

  ;; Undo/redo
  ("C-/" undo)
  ("C-g C-/" undo-redo)

  ;; Special
  ("C-x C-o" delete-blank-lines)
  ("M-^" delete-indentation)
  ("C-t" transpose-chars)
  ("M-t" transpose-words)

  ("q" nil "quit"))

;; Regions hydra
(defhydra hydra-regions (:color red :hint nil)
  "
^Mark^           ^Select^         ^Operations^     ^Exchange^
──────────────────────────────────────────────────────────────
C-SPC: mark      C-x h: all       C-w: kill        C-x C-x: exchange
M-h: paragraph   M-@: word        M-w: copy        ^
C-M-h: defun     C-M-@: sexp      C-y: yank        ^
^                ^                M-y: yank pop    ^
^                ^                _q_: quit        ^
"
  ;; Mark
  ("C-SPC" set-mark-command)
  ("M-h" mark-paragraph)
  ("C-M-h" mark-defun)

  ;; Select
  ("C-x h" mark-whole-buffer :color blue)
  ("M-@" mark-word)
  ("C-M-@" mark-sexp)

  ;; Operations
  ("C-w" kill-region)
  ("M-w" copy-region-as-kill)
  ("C-y" yank)
  ("M-y" yank-pop)

  ;; Exchange
  ("C-x C-x" exchange-point-and-mark)

  ("q" nil "quit"))

;; Windows hydra
(defhydra hydra-windows (:color red :hint nil)
  "
^Split^          ^Navigate^       ^Resize^         ^Manage^
──────────────────────────────────────────────────────────────
_2_: horizontal  _o_: other       _+_: taller      _0_: delete
_3_: vertical    _p_: prev        _-_: shorter     _1_: delete others
^                _n_: next        _{_: narrower    _q_: quit
^                ^                _}_: wider       ^
"
  ;; Split
  ("2" split-window-below)
  ("3" split-window-right)

  ;; Navigate
  ("o" other-window)
  ("p" (other-window -1))
  ("n" other-window)

  ;; Resize
  ("+" enlarge-window)
  ("-" shrink-window)
  ("{" shrink-window-horizontally)
  ("}" enlarge-window-horizontally)

  ;; Manage
  ("0" delete-window :color blue)
  ("1" delete-other-windows :color blue)

  ("q" nil "quit"))

;; Frames hydra
(defhydra hydra-frames (:color red :hint nil)
  "
^Create^         ^Navigate^       ^Manage^
─────────────────────────────────────────────
2: new frame o: other     0: delete
^                p: prev      1: delete others
^                n: next      _q_: quit
"
  ;; Create
  ("2" make-frame-command :color blue)

  ;; Navigate
  ("o" other-frame)
  ("p" (other-frame -1))
  ("n" other-frame)

  ;; Manage
  ("0" delete-frame :color blue)
  ("1" delete-other-frames :color blue)

  ("q" nil "quit"))

;; Buffers hydra
(defhydra hydra-buffers (:color red :hint nil)
  "
^Navigate^       ^Switch^         ^Manage^         ^Special^
─────────────────────────────────────────────────────────────
C-→: next        C-x b: switch    C-x k: kill      C-x C-b: list
C-←: prev        C-x 4 b: other   _s_: save        _b_: ibuffer
^                C-x 5 b: frame   _S_: save all    _q_: quit
"
  ;; Navigate
  ("C-→" next-buffer)
  ("C-←" previous-buffer)

  ;; Switch
  ("C-x b" switch-to-buffer :color blue)
  ("C-x 4 b" switch-to-buffer-other-window :color blue)
  ("C-x 5 b" switch-to-buffer-other-frame :color blue)

  ;; Manage
  ("C-x k" kill-buffer :color blue)
  ("s" save-buffer)
  ("S" save-some-buffers)

  ;; Special
  ("C-x C-b" list-buffers :color blue)
  ("b" ibuffer :color blue)

  ("q" nil "quit"))

;; Search hydra
(defhydra hydra-search (:color red :hint nil)
  "
^Search^         ^Replace^        ^Grep^           ^Advanced^
─────────────────────────────────────────────────────────────
C-s: forward     M-%: replace     M-x rg: rg       C-M-s: regex
C-r: backward    C-M-%: regex     M-x ag: ag       M-s o: occur
M-s .: symbol    ^                ^                _q_: quit
"
  ;; Search
  ("C-s" isearch-forward :color blue)
  ("C-r" isearch-backward :color blue)
  ("M-s ." isearch-forward-symbol-at-point :color blue)
  ("C-M-s" isearch-forward-regexp :color blue)

  ;; Replace
  ("M-%" query-replace :color blue)
  ("C-M-%" query-replace-regexp :color blue)

  ;; Grep
  ("M-x rg" rg :color blue)
  ("M-x ag" ag :color blue)

  ;; Advanced
  ("M-s o" occur :color blue)

  ("q" nil "quit"))

;; Navigation hydra
(defhydra hydra-navigation (:color red :hint nil)
  "
^Jump^           ^Bookmarks^      ^Registers^      ^Recent^
──────────────────────────────────────────────────────────────
M-g g: line      C-x r m: mark    C-x r SPC: pt    C-x C-r: recent
M-g c: char      C-x r b: jump    C-x r s: copy    ^
M-g w: word      C-x r l: list    C-x r i: insert  ^
^                ^                _q_: quit        ^
"
  ;; Jump
  ("M-g g" goto-line :color blue)
  ("M-g c" goto-char :color blue)
  ("M-g w" goto-word :color blue)

  ;; Bookmarks
  ("C-x r m" bookmark-set :color blue)
  ("C-x r b" bookmark-jump :color blue)
  ("C-x r l" bookmark-bmenu-list :color blue)

  ;; Registers
  ("C-x r SPC" point-to-register :color blue)
  ("C-x r s" copy-to-register :color blue)
  ("C-x r i" insert-register :color blue)

  ;; Recent
  ("C-x C-r" recentf-open-files :color blue)

  ("q" nil "quit"))

;; Dired hydra
(defhydra hydra-dired (:color red :hint nil)
  "
^Navigate^       ^Mark^           ^Operations^     ^View^
─────────────────────────────────────────────────────────
_j_: next        _m_: mark        _C_: copy        _(_: details
_k_: prev        _u_: unmark      _R_: rename      _)_: hide details
_RET_: open      _t_: toggle      _D_: delete      _q_: quit
_^_: up dir      _U_: unmark all  _+_: mkdir       ^
"
  ;; Navigate
  ("j" dired-next-line)
  ("k" dired-previous-line)
  ("RET" dired-find-file :color blue)
  ("^" dired-up-directory)

  ;; Mark
  ("m" dired-mark)
  ("u" dired-unmark)
  ("t" dired-toggle-marks)
  ("U" dired-unmark-all-marks)

  ;; Operations
  ("C" dired-do-copy)
  ("R" dired-do-rename)
  ("D" dired-do-delete)
  ("+" dired-create-directory)

  ;; View
  ("(" dired-hide-details-mode)
  (")" dired-hide-details-mode)

  ("q" nil "quit"))

;; Help hydra
(defhydra hydra-help (:color blue :hint nil)
  "
^Describe^       ^Info^           ^Apropos^        ^Other^
─────────────────────────────────────────────────────────
_f_: function    _i_: info        _a_: command     _w_: where-is
_v_: variable    C-h i: info      _d_: doc         _c_: key-briefly
_k_: key         ^                _s_: symbol      _m_: mode
_b_: bindings    ^                _e_: face        _q_: quit
"
  ;; Describe
  ("f" describe-function)
  ("v" describe-variable)
  ("k" describe-key)
  ("b" describe-bindings)

  ;; Info
  ("i" info)
  ("C-h i" info)

  ;; Apropos
  ("a" apropos-command)
  ("d" apropos-documentation)
  ("s" apropos-symbol)
  ("e" apropos-face)

  ;; Other
  ("w" where-is)
  ("c" describe-key-briefly)
  ("m" describe-mode)

  ("q" nil "quit"))

;; Ansible hydra
(defhydra hydra-ansible (:color blue :hint nil)
  "
^Documentation^  ^Vault^          ^Execution^      ^Navigation^
─────────────────────────────────────────────────────────────
_d_: module doc  _v e_: encrypt   _p_: playbook    _g_: goto task
_D_: doc at pt   _v d_: decrypt   _t_: task        _r_: role
_m_: modules     _v v_: view      h: handler     _i_: inventory
^                ^                _c_: check       _q_: quit
"
  ;; Documentation
  ("d" ansible-doc)
  ("D" ansible-doc-at-point)
  ("m" (lambda () (interactive) (ansible-doc "")))

  ;; Vault (if available)
  ("v e" ansible-vault-encrypt-buffer :color blue)
  ("v d" ansible-vault-decrypt-buffer :color blue)
  ("v v" ansible-vault-view-file :color blue)

  ;; Execution
  ("p" (lambda () (interactive)
         (compile (read-string "Ansible playbook: " "ansible-playbook ")))
   :color blue)
  ("t" (lambda () (interactive)
         (compile (read-string "Ansible task: " "ansible ")))
   :color blue)
  ("c" (lambda () (interactive)
         (compile (read-string "Ansible check: " "ansible-playbook --check ")))
   :color blue)

  ;; Navigation
  ("g" (lambda () (interactive) (occur "- name:")) :color blue)
  ("r" (lambda () (interactive) (occur "role:")) :color blue)
  ("i" (lambda () (interactive) (find-file "inventory")) :color blue)

  ("q" nil "quit"))

;; Global keybinding for the master cheatsheet
(global-set-key (kbd "<f1>") 'hydra-cheatsheet/body)
(global-set-key (kbd "C-h C-h") 'hydra-cheatsheet/body)

;; Direct access to Ansible hydra
(global-set-key (kbd "C-c A") 'hydra-ansible/body)
