.emacs.d/config.org
** Export Menu Enhancement
#+begin_src emacs-lisp
;; Custom export dispatcher with more options
(defun my/org-export-dispatch-enhanced ()
  "Enhanced export dispatcher with all export options."
  (interactive)
  (let ((org-export-dispatch-use-expert-ui t))
    (org-export-dispatch)))

;; Quick export functions
(defun my/org-export-to-pdf ()
  "Export current org buffer to PDF via pandoc."
  (interactive)
  (org-pandoc-export-to-latex-pdf))

(defun my/org-export-to-docx ()
  "Export current org buffer to DOCX via pandoc."
  (interactive)
  (org-pandoc-export-to-docx))

(defun my/org-export-to-hugo ()
  "Export current org buffer to Hugo markdown."
  (interactive)
  (org-hugo-export-wim-to-md))

;; Bind quick export functions
(define-key org-mode-map (kbd "C-c e p") #'my/org-export-to-pdf)
(define-key org-mode-map (kbd "C-c e d") #'my/org-export-to-docx)
(define-key org-mode-map (kbd "C-c e h") #'my/org-export-to-hugo)
(define-key org-mode-map (kbd "C-c e e") #'my/org-export-dispatch-enhanced)
#+end_src

** Advanced Features - Org QL
#+begin_src emacs-lisp
(use-package org-ql
  :ensure t
  :after org
  :bind (("C-c q q" . org-ql-search)
         ("C-c q v" . org-ql-view)
         ("C-c q b" . org-ql-search-block)
         ("C-c q r" . org-ql-sparse-tree))

  :config
  ;; Custom org-ql searches
  (defun my/org-ql-today-tasks ()
    "Show tasks scheduled for today."
    (interactive)
    (org-ql-search (org-agenda-files)
      '(and (todo "TODO" "NEXT" "DOING")
            (scheduled :to today))))

  (defun my/org-ql-next-actions ()
    "Show all next actions."
    (interactive)
    (org-ql-search (org-agenda-files)
      '(todo "NEXT")))

  (defun my/org-ql-projects ()
    "Show all project items."
    (interactive)
    (org-ql-search (org-agenda-files)
      '(and (todo)
            (tags "project"))))

  (defun my/org-ql-waiting ()
    "Show items waiting for something."
    (interactive)
    (org-ql-search (org-agenda-files)
      '(and (todo)
            (tags "waiting"))))

  (defun my/org-ql-overdue ()
    "Show overdue items."
    (interactive)
    (org-ql-search (org-agenda-files)
      '(and (todo)
            (deadline :to yesterday))))

  (defun my/org-ql-recent-notes ()
    "Show notes created in the last week."
    (interactive)
    (org-ql-search (org-agenda-files)
      '(ts :from -7)))

  ;; Bind custom searches
  (define-key org-mode-map (kbd "C-c q t") #'my/org-ql-today-tasks)
  (define-key org-mode-map (kbd "C-c q n") #'my/org-ql-next-actions)
  (define-key org-mode-map (kbd "C-c q p") #'my/org-ql-projects)
  (define-key org-mode-map (kbd "C-c q w") #'my/org-ql-waiting)
  (define-key org-mode-map (kbd "C-c q o") #'my/org-ql-overdue)
  (define-key org-mode-map (kbd "C-c q R") #'my/org-ql-recent-notes))
#+end_src

** Web Integration - Org Cliplink
#+begin_src emacs-lisp
(use-package org-cliplink
  :ensure t
  :after org
  :bind (("C-c L" . org-cliplink)
         ("C-c M-l" . org-cliplink-capture))

  :config
  ;; Custom function to cliplink and add to inbox
  (defun my/org-cliplink-to-inbox ()
    "Add cliplink to inbox with TODO."
    (interactive)
    (let ((link (org-cliplink-retrieve-title-synchronously
                 (substring-no-properties (current-kill 0)))))
      (org-capture nil "l")))

  ;; Enhanced cliplink with metadata
  (defun my/org-cliplink-with-metadata ()
    "Insert cliplink with additional metadata."
    (interactive)
    (let* ((url (substring-no-properties (current-kill 0)))
           (title (org-cliplink-retrieve-title-synchronously url))
           (timestamp (format-time-string "%Y-%m-%d")))
      (insert (format "** [[%s][%s]]\n   :PROPERTIES:\n   :URL: %s\n   :ADDED: %s\n   :END:\n\n"
                      url title url timestamp))))

  (global-set-key (kbd "C-c C-L") #'my/org-cliplink-with-metadata))
#+end_src

** Media Management - Org Download
#+begin_src emacs-lisp
(use-package org-download
  :ensure t
  :after org
  :bind (("C-c d y" . org-download-yank)
         ("C-c d s" . org-download-screenshot)
         ("C-c d f" . org-download-image)
         ("C-c d r" . org-download-rename-at-point)
         ("C-c d d" . org-download-delete))

  :custom
  ;; Directory structure
  (org-download-method 'directory)
  (org-download-image-dir "images")
  (org-download-image-org-width 600)
  (org-download-image-attr-list '("#+ATTR_HTML: :width 600px"
                                  "#+ATTR_LATEX: :width 0.8\\textwidth"))

  ;; File naming
  (org-download-timestamp "%Y%m%d-%H%M%S_")
  (org-download-heading-lvl nil)
  (org-download-delete-image-after-download t)

  ;; Screenshot settings
  (org-download-screenshot-method
   (cond ((eq system-type 'darwin) "screencapture -i %s")
         ((eq system-type 'gnu/linux) "gnome-screenshot -a -f %s")
         (t "scrot -s %s")))

  :config
  ;; Auto-enable in org-mode
  (add-hook 'org-mode-hook #'org-download-enable)

  ;; Custom functions
  (defun my/org-download-method (link)
    "Custom download method that creates better directory structure."
    (let* ((filename (file-name-nondirectory
                      (car (url-path-and-query
                            (url-generic-parse-url link)))))
           (dirname (file-name-base (buffer-file-name)))
           (dir (format "%s/%s" org-download-image-dir dirname)))
      (unless (file-directory-p dir)
        (make-directory dir t))
      (format "%s/%s%s" dir (org-download-timestamp) filename)))

  (setq org-download-method #'my/org-download-method)

  ;; Drag and drop support
  (defun my/org-download-dnd (uri action)
    "Handle drag and drop for images."
    (if (eq action 'private)
        (prog1 action
          (org-download-image uri))
      ;; Use dnd-handle-multiple-urls instead of obsolete dnd-handle-one-url
      (let ((dnd-protocol-alist
             (rassq-delete-all 'my/org-download-dnd
                               (copy-alist dnd-protocol-alist))))
        (if (fboundp 'dnd-handle-multiple-urls)
            (dnd-handle-multiple-urls nil action (list uri))
          ;; Fallback for older Emacs versions
          (dnd-handle-one-url nil action uri)))))

  (add-to-list 'dnd-protocol-alist '("^https?://" . my/org-download-dnd)))
#+end_src

