.emacs.d/config.org
** Enhanced Agenda - Org Super Agenda
#+begin_src emacs-lisp
(use-package org-super-agenda
  :ensure t
  :after org-agenda
  :bind (("C-c s a" . org-super-agenda-mode))

  :custom
  (org-super-agenda-groups
   '(;; Each group has an implicit boolean OR operator between its selectors.
     (:name "Today"
      :time-grid t
      :date today
      :todo "TODAY"
      :scheduled today
      :order 1)

     (:name "Important"
      :tag "Important"
      :priority "A"
      :order 2)

     (:name "Due Today"
      :deadline today
      :order 3)

     (:name "Due Soon"
      :deadline future
      :order 4)

     (:name "Overdue"
      :deadline past
      :face error
      :order 5)

     (:name "Projects"
      :tag "project"
      :order 6)

     (:name "Work"
      :tag "work"
      :order 7)

     (:name "Personal"
      :tag "personal"
      :order 8)

     (:name "Next Actions"
      :todo "NEXT"
      :order 9)

     (:name "Waiting"
      :todo "WAITING"
      :tag "waiting"
      :order 10)

     (:name "Ideas"
      :todo "IDEA"
      :tag "idea"
      :order 11)

     (:name "Scheduled Earlier"
      :scheduled past
      :order 12)))

  :config
  (org-super-agenda-mode 1)

  ;; Custom super agenda views
  (setq org-agenda-custom-commands
        '(("z" "Super Agenda"
           ((agenda ""
                    ((org-agenda-span 'day)
                     (org-super-agenda-groups
                      '((:name "Today"
                         :time-grid t
                         :date today
                         :scheduled today
                         :order 1)
                        (:name "Important"
                         :priority "A"
                         :order 2)
                        (:name "Due today"
                         :deadline today
                         :order 3)
                        (:name "Overdue"
                         :deadline past
                         :order 4)))))
            (alltodo ""
                     ((org-agenda-overriding-header "")
                      (org-super-agenda-groups
                       '((:name "Next Actions"
                          :todo "NEXT"
                          :order 1)
                         (:name "Projects"
                          :tag "project"
                          :order 2)
                         (:name "Work"
                          :tag "work"
                          :order 3)
                         (:name "Personal"
                          :tag "personal"
                          :order 4)
                         (:name "Ideas"
                          :todo "IDEA"
                          :order 5)
                         (:discard (:anything t))))))))

          ("w" "Work Focus"
           ((agenda ""
                    ((org-agenda-span 'day)
                     (org-super-agenda-groups
                      '((:name "Work Today"
                         :and (:tag "work" :scheduled today)
                         :order 1)
                        (:name "Work Due"
                         :and (:tag "work" :deadline t)
                         :order 2)))))
            (todo "NEXT"
                  ((org-agenda-overriding-header "Work Next Actions")
                   (org-super-agenda-groups
                    '((:name "High Priority"
                       :and (:tag "work" :priority "A")
                       :order 1)
                      (:name "Regular"
                       :tag "work"
                       :order 2)
                      (:discard (:anything t))))))))

          ("p" "Personal Focus"
           ((agenda ""
                    ((org-agenda-span 'day)
                     (org-super-agenda-groups
                      '((:name "Personal Today"
                         :and (:tag "personal" :scheduled today)
                         :order 1)
                        (:name "Personal Due"
                         :and (:tag "personal" :deadline t)
                         :order 2)))))
            (todo "NEXT"
                  ((org-agenda-overriding-header "Personal Next Actions")
                   (org-super-agenda-groups
                    '((:name "High Priority"
                       :and (:tag "personal" :priority "A")
                       :order 1)
                      (:name "Regular"
                       :tag "personal"
                       :order 2)
                      (:discard (:anything t))))))))

          ("r" "Review"
           ((todo "DONE"
                  ((org-agenda-overriding-header "Recently Completed")
                   (org-agenda-span 'week)
                   (org-super-agenda-groups
                    '((:name "Work Completed"
                       :tag "work"
                       :order 1)
                      (:name "Personal Completed"
                       :tag "personal"
                       :order 2)
                      (:name "Projects Completed"
                       :tag "project"
                       :order 3)))))))))

  ;; Custom agenda functions
  (defun my/org-super-agenda-toggle ()
    "Toggle org-super-agenda-mode."
    (interactive)
    (org-super-agenda-mode 'toggle)
    (org-agenda-redo-all)
    (message "Org Super Agenda: %s" (if org-super-agenda-mode "enabled" "disabled"))))
#+end_src

* Projects

Project management system that provides intelligent navigation, search, and operations across project boundaries. Integrates with version control, completion frameworks, and build tools.

*Key Benefits:*
- Automatic project detection (Git, .projectile file, etc.)
- Fast file and buffer navigation within projects
- Project-aware search and replace operations
- Integration with compilation and testing workflows
- Multi-project workspace management

*Core Workflows:*
| Workflow | Key Binding | Purpose |
|----------|-------------|---------|
| Project Switching | C-c P p | Switch between projects |
| File Navigation | C-c P f | Find files in current project |
| Project Search | C-c P s g | Grep within project |
| Buffer Management | C-c p b | Project-specific buffers |
| Project Overview | C-c p p | Enhanced project switcher |

** Enhanced Projectile Integration

Modern completion interface for Projectile using Consult. Provides enhanced project navigation with live previews and better filtering capabilities.

*Project:* [[https://github.com/emacs-straight/consult-projectile][GitHub - consult-projectile]]
*Features:*
- Live preview when switching projects
- Enhanced file and buffer navigation
- Integration with Consult's completion system
- Improved performance for large projects
*** Consult Projectile
#+begin_src emacs-lisp
(use-package consult-projectile
  :ensure t
  :bind (("C-c p p" . consult-projectile)
         ("C-c p f" . consult-projectile-find-file)
         ("C-c p b" . consult-projectile-switch-to-buffer)))
#+end_src

