.emacs.d/config.org
** Projectile

Comprehensive project management for Emacs that automatically detects projects and provides context-aware commands. Essential for navigating and working with large codebases.

*Project:* [[https://projectile.mx/][Official Site]], [[https://github.com/bbatsov/projectile][GitHub - projectile]]
*Key Features:*
- Automatic project detection via VCS or .projectile files
- Fast file indexing and searching
- Project-aware compilation and testing
- Integration with version control systems
- Customizable project types and commands

*Essential Commands:*
| Key | Command | Purpose |
|-----|---------|---------|
| C-c P p | projectile-switch-project | Switch to another project |
| C-c P f | projectile-find-file | Find file in current project |
| C-c P b | projectile-switch-to-buffer | Switch to project buffer |
| C-c P s g | projectile-grep | Search in project files |
| C-c P c | projectile-compile-project | Build/compile project |
| C-c P r | projectile-replace | Replace in project |

*Project Detection:*
- Git repositories
- Mercurial repositories
- .projectile files
- Language-specific files (package.json, Cargo.toml, etc.)

*Documentation:* =C-h f projectile-mode=, [[https://projectile.mx/en/latest/][Projectile Manual]]
#+begin_src emacs-lisp :tangle yes
(use-package projectile
  :ensure t
  :init
  (projectile-mode +1)

  :bind-keymap
  ("C-c P" . projectile-command-map)  ; Main projectile prefix

  :bind (;; Alternative quick access (non-conflicting keys)
         ("s-p" . projectile-find-file)       ; Super key for quick file find
         ("s-b" . projectile-switch-to-buffer) ; Super key for buffer switch
         ("s-t" . projectile-toggle-between-implementation-and-test))

  :custom
  ;; Project discovery
  (projectile-project-search-path '("~/code/" "~/work/" "~/.config/"))
  (projectile-auto-discover t)
  (projectile-require-project-root nil)   ; Don't require explicit project root

  ;; Performance
  (projectile-enable-caching t)
  (projectile-indexing-method 'hybrid)   ; Use both native and alien methods
  (projectile-sort-order 'recentf)       ; Sort by recently used

  ;; Completion
  (projectile-completion-system 'default) ; Use default completion (works with vertico)
  (projectile-switch-project-action #'projectile-dired) ; Default action when switching

  ;; File discovery
  (projectile-globally-ignored-files '("TAGS" "*.log" "*.tmp" "*.bak"))
  (projectile-globally-ignored-file-suffixes '(".elc" ".pyc" ".o" ".class"))
  (projectile-globally-ignored-directories
   '(".git" ".svn" ".hg" "node_modules" "__pycache__" ".pytest_cache"
     "venv" ".venv" "env" ".env" "target" "build" "dist" ".next"))

  ;; Project types and commands
  (projectile-project-root-files-functions
   '(projectile-root-local
     projectile-root-marked
     projectile-root-top-down
     projectile-root-bottom-up
     projectile-root-top-down-recurring))

  :config
  ;; Additional project root markers
  (add-to-list 'projectile-project-root-files "pyproject.toml")
  (add-to-list 'projectile-project-root-files "Cargo.toml")
  (add-to-list 'projectile-project-root-files "package.json")
  (add-to-list 'projectile-project-root-files "go.mod")
  (add-to-list 'projectile-project-root-files "requirements.txt")
  (add-to-list 'projectile-project-root-files ".projectile")
  (add-to-list 'projectile-project-root-files "ansible.cfg")
  (add-to-list 'projectile-project-root-files "playbook.yml")
  (add-to-list 'projectile-project-root-files "site.yml")

  ;; Custom project types
  (projectile-register-project-type 'npm '("package.json")
                                    :project-file "package.json"
                                    :compile "npm run build"
                                    :test "npm test"
                                    :run "npm start"
                                    :test-suffix ".test")

  (projectile-register-project-type 'python-pip '("requirements.txt")
                                    :project-file "requirements.txt"
                                    :compile "python setup.py build"
                                    :test "python -m pytest"
                                    :test-suffix "_test")

  (projectile-register-project-type 'python-poetry '("pyproject.toml")
                                    :project-file "pyproject.toml"
                                    :compile "poetry build"
                                    :test "poetry run pytest"
                                    :run "poetry run python"
                                    :test-suffix "_test")

  (projectile-register-project-type 'ansible '("ansible.cfg" "playbook.yml" "site.yml")
                                    :project-file "ansible.cfg"
                                    :compile "ansible-playbook --syntax-check site.yml"
                                    :test "ansible-playbook --check site.yml"
                                    :run "ansible-playbook site.yml")

  ;; Enhanced functions
  (defun my/projectile-find-file-in-known-projects ()
    "Find file in any known project."
    (interactive)
    (projectile-find-file-in-known-projects))

  (defun my/projectile-switch-project-magit ()
    "Switch to project and open magit."
    (interactive)
    (let ((projectile-switch-project-action #'magit-status))
      (projectile-switch-project)))

  (defun my/projectile-run-shell-command-in-project ()
    "Run shell command in project root."
    (interactive)
    (let ((default-directory (projectile-project-root)))
      (call-interactively #'shell-command)))

  (defun my/projectile-open-terminal-in-project ()
    "Open terminal in project root."
    (interactive)
    (let ((default-directory (projectile-project-root)))
      (if (fboundp 'eat)
          (eat)
        (if (fboundp 'vterm)
            (vterm)
          (shell)))))

  ;; Additional keybindings
  (define-key projectile-command-map (kbd "F") #'my/projectile-find-file-in-known-projects)
  (define-key projectile-command-map (kbd "M") #'my/projectile-switch-project-magit)
  (define-key projectile-command-map (kbd "!") #'my/projectile-run-shell-command-in-project)
  (define-key projectile-command-map (kbd "C-t") #'my/projectile-open-terminal-in-project)

  ;; Cache management
  (defun my/projectile-cleanup-known-projects ()
    "Remove non-existent projects from known projects."
    (interactive)
    (projectile-cleanup-known-projects)
    (message "Cleaned up known projects"))

  (define-key projectile-command-map (kbd "C-c") #'my/projectile-cleanup-known-projects))
#+end_src
*** projectile-ripgrep
#+begin_src emacs-lisp :tangle yes
(use-package projectile-ripgrep
  :ensure t
  :after projectile
  :bind (:map projectile-command-map
              ("s r" . projectile-ripgrep)))
#+end_src

*** Support Functions
#+begin_src emacs-lisp :tangle yes
(defun my/projectile-avy-find-file ()
  "Use avy to select a file from projectile-find-file."
  (interactive)
  (let ((avy-all-windows t))
    (projectile-find-file)))

;; Enhanced project workflow
(defun my/project-overview ()
  "Show project overview with magit status."
  (interactive)
  (when (projectile-project-p)
    (magit-status)
    (split-window-right)
    (other-window 1)
    (projectile-find-file)))

;; Status line integration
(defun my/modeline-projectile-project-name ()
  "Show current project name in modeline."
  (when (and (bound-and-true-p projectile-mode)
             (projectile-project-p))
    (format " [%s]" (projectile-project-name))))

(add-to-list 'mode-line-misc-info
             '(:eval (my/modeline-projectile-project-name)))
#+end_src
* AI Tools
** Aider

#+begin_src emacs-lisp
;; NOTE: temporary tangler fix removed. If you still hit EOF while loading
;; config.el, retangle after making corrections to the code above. Avoid
;; adding raw closing parens here; instead fix the source blocks that are
;; missing their proper closing forms.
nil ; no-op placeholder to keep tangling stable
#+end_src
